{"version": "https://jsonfeed.org/version/1.1", "title": "Eric on Identity", "home_page_url": "https://www.ericonidentity.com/", "feed_url": "https://www.ericonidentity.com/feed_json_created.json", "description": null, "icon": null, "authors": [], "language": "en", "items": [{"id": "https://www.ericonidentity.com/2025/09/02/entra-useless-insights-report/", "url": "https://www.ericonidentity.com/2025/09/02/entra-useless-insights-report/", "title": "Entra Useless Insights Report", "content_html": "<h1>Entra Useless Insights Report</h1>\n<h2>Overview</h2>\n<p>Yes. The name is snarky on purpose.</p>\n<p>With the drive to using phishing-resistant MFA something on the mind of many organizations, I’ve been taking a look at the Usage &amp; Insights Report features in Entra, specifically the <strong>Authentication methods</strong> activity report.</p>\n<p>Enumerating the type of authentication methods registered on a user, on a per-user basis, can be time consuming, and would become untenable in extremely large organizations.</p>\n<p>Authentication methods activity reporting to the rescue – right? Not so much.</p>\n<p>In digging into the report, whether it’s through the <a href=\"https://entra.microsoft.com/#view/Microsoft_AAD_IAM/AuthenticationMethodsMenuBlade/~/AuthMethodsActivity/menuId/AuthMethodsActivity\">Entra admin center</a> or through Microsoft Graph PowerShell SDK, the data reported through this is just astoundingly awful if you want to try and build some basic measurements around who is actually registered for passkeys (FIDO2); I haven’t looked to see if it’s as awful with other methods.</p>\n<p>Luckily in the tenant I’m examining, there are only a few hundred user objects, so it’s also feasible to enumerate each user the long way, which I’ll cover below as the workaround. I’ve posed a complaint to Microsoft in some channels and have yet to hear anything back, other than similar experiences from a few others.</p>", "image": null, "date_modified": "2025-11-28T21:13:44.131524+00:00", "date_published": "2025-09-02T00:00:00+00:00", "authors": [{"name": "Eric Woodruff"}], "tags": ["Entra ID"]}, {"id": "https://www.ericonidentity.com/2025/02/20/an-interesting-m365-billing-scam/", "url": "https://www.ericonidentity.com/2025/02/20/an-interesting-m365-billing-scam/", "title": "An Interesting M365 Billing Scam", "content_html": "<h1>An Interesting M365 Billing Scam</h1>\n<h2>Update</h2>\n<p>I called the 888 number this morning and it does indeed go to a scam call center. I played along with the person on the other end, who ultimately wanted my first and last name, email address, the order number, and most importantly, my credit card number, so they “could reverse the charge” 🤣</p>\n<h2>The Scam</h2>\n<p>This is a case where I’d actually love to see how this plays out – when you see the way that scammers try to string things together. I’ve been receiving a rash of unpaid toll bill texts, which give themselves away pretty easily based on the source number. But I’m not here to talk about that scam.</p>\n<p>Instead, I’m here to dig into this email I received last week:</p>", "image": null, "date_modified": "2025-11-28T21:13:43.437473+00:00", "date_published": "2025-02-20T00:00:00+00:00", "authors": [{"name": "Eric Woodruff"}], "tags": ["Microsoft 365"]}, {"id": "https://www.ericonidentity.com/2025/01/13/spying-on-your-isvs-credential-choices/", "url": "https://www.ericonidentity.com/2025/01/13/spying-on-your-isvs-credential-choices/", "title": "Spying On Your ISVs Credential Choices", "content_html": "<h1>Spying On Your ISVs Credential Choices</h1>\n<h2>Overview</h2>\n<p>Microsoft, and the general identity industry, has recommended that applications use certificates over secrets when it comes to credentials for things like applications. This recommendation has existed for about as long modern authentication and authorization systems have existed – over a decade now. Yet the reality is that there continues to be mystery shrouded around certificates, and sysadmins and developers still lean into using secrets.</p>\n<p>Secrets are problematic because they are nothing more than a password. Secrets are so much just a password that while Microsoft might refer to secrets as secrets in the UI for Entra, the underlying attribute name is passwordCredentials! While you can use systems like Azure Key Vault for secure management of who has access to the secrets, the reality is that secrets tend to be managed insecurely, both in transport and at rest. Identity Protection exists for workload identities, but it is not real time, and there are scenarios where it will not help you if the abuse is coming from inside the same trusted network.</p>\n<p>It’s easy for organizations to determine what they are using with single-tenant applications, or if they are a developer of a multi-tenant app. A quick Microsoft Graph API call to applications/objectid of the application (app registration), and you can examine whether the application has certificates, secrets, or both assigned as credentials. You can also store credentials on the service principal, which I cover here, <a href=\"https://ericonidentity.com/2023/03/11/aad-app-registrations-and-enterprise-applications-the-definitive-guide/\">Entra App Registrations and Enterprise Applications: The Definitive Guide – Eric on Identity</a>.</p>", "image": null, "date_modified": "2025-11-28T21:13:44.429813+00:00", "date_published": "2025-01-13T00:00:00+00:00", "authors": [{"name": "Eric Woodruff"}], "tags": ["Entra ID"]}, {"id": "https://www.ericonidentity.com/2024/03/26/the-intersection-of-graph-and-entra-id-application-permissions-and-roles/", "url": "https://www.ericonidentity.com/2024/03/26/the-intersection-of-graph-and-entra-id-application-permissions-and-roles/", "title": "The Intersection of Graph and Entra ID: Application Permissions and Roles", "content_html": "<h1>The Intersection of Graph and Entra ID: Application Permissions and Roles</h1>\n<p>When you work someplace that develops software that interacts with Entra ID, the question of Graph permissions eventually comes up. With the recent Midnight Blizzard attack against Microsoft, where a threat actor appears to have used service principals and Graph permissions to access resources in Microsoft’s own Entra tenant, the scrutiny on permissions grows even more intense. You can read more about this with a great write-up from Andy Robbins here, <a href=\"https://posts.specterops.io/microsoft-breach-what-happened-what-should-azure-admins-do-da2b7e674ebc\">Microsoft Breach — What Happened? What Should Azure Admins Do? | by Andy Robbins | Feb, 2024 | Posts By SpecterOps Team Members</a>.</p>\n<h2>Primer on the Microsoft Graph API</h2>\n<p>Before jumping into the permission weeds, let’s review a few things to set the stage. If you already understand the Graph API basics, feel free to scroll past.</p>\n<h3>What is Graph API</h3>\n<p>The Microsoft Graph API is the unified API endpoint into <strong>most</strong> Microsoft 365 services, which includes Entra ID. For purposes of this article, the terms Graph and Graph API refer to the Microsoft Graph API.</p>\n<p><img alt=\"Figure 1\" src=\"/images/2024/03/26/img1.png\"></p>\n<p><em>Microsoft Graph API diagram / Courtesy Microsoft Learn</em></p>\n<p>You can read more of an overview about the Graph API here, <a href=\"https://learn.microsoft.com/en-us/graph/overview?WT.mc_id=SEC-MVP-5005105\">Microsoft Graph overview – Microsoft Graph | Microsoft Learn</a>.</p>", "image": null, "date_modified": "2025-11-28T21:13:44.530061+00:00", "date_published": "2024-03-26T00:00:00+00:00", "authors": [{"name": "Eric Woodruff"}], "tags": ["Entra ID"]}, {"id": "https://www.ericonidentity.com/2023/08/29/dude-wheres-my-audit-logs/", "url": "https://www.ericonidentity.com/2023/08/29/dude-wheres-my-audit-logs/", "title": "Dude, Where's My Audit Logs?", "content_html": "<h1>Dude, Where's My Audit Logs?</h1>\n<p>Audit logs can provide all sorts of wonderful points of data. In the interest of identity security, we have historically seen that we can glean rich sets of information around what’s happening in a directory service with some properly functioning audit logging. For many identity practitioners, there is the expectation that while we may not always look at the audit logs or their details, if or when we need them, they’ll be there to help us understand whatever it is we are investigating. Same goes for compliance and auditing as well.</p>\n<p>Considering that customers have no ability to impact what or how auditing happens in Entra ID, in the shared responsibility model, it’s on Microsoft to ensure all events are audited.</p>\n<p><img alt=\"Figure 1\" src=\"/images/2023/08/29/img1.png\"></p>\n<p><em>Shared responsibility model, courtesy Microsoft, with identity and directory infrastructure highlighted.</em></p>\n<p>Microsoft documents what is audited in Entra ID, which you can find here, <a href=\"https://learn.microsoft.com/en-us/azure/active-directory/reports-monitoring/reference-audit-activities?WT.mc_id=SEC-MVP-5005105\">Azure Active Directory (Azure AD) audit activity reference – Microsoft Entra | Microsoft Learn</a>.</p>", "image": null, "date_modified": "2025-11-28T21:13:44.086244+00:00", "date_published": "2023-08-29T00:00:00+00:00", "authors": [{"name": "Eric Woodruff"}], "tags": ["Entra ID"]}, {"id": "https://www.ericonidentity.com/2023/07/17/protect-your-privilege-with-paw/", "url": "https://www.ericonidentity.com/2023/07/17/protect-your-privilege-with-paw/", "title": "Protect Your Privilege with PAW", "content_html": "<h1>Protect Your Privilege with PAW</h1>\n<p>According to the Microsoft Digital Defense Report 2022, weak identity controls are listed as a top three contributing factors found during ransomware incident response. One particularly troubling finding within identity controls is the lack of Privileged Access Workstations (PAW) found in any response engagement:</p>\n<p><em>None of the impacted organizations implemented proper administrative credential segregation and least privilege access principals via dedicated workstations during the management of their critical identity and high-value assets, such as proprietary systems and business-critical applications.</em></p>\n<p><em><a href=\"https://www.microsoft.com/en-us/security/business/microsoft-digital-defense-report-2022?WT.mc_id=SEC-MVP-5005105\">Microsoft Digital Defense Report 2022, page 15 (Microsoft Digital Defense Report 2022 | Microsoft Security)</a></em></p>\n<p>The report does not speculate as to <strong>why</strong> the organizations were not using PAW, but for anyone seasoned out there in the world of consultancy the answers will look like:</p>\n<ul>\n<li>Lack of time/budget/resources/priority</li>\n<li>Lack of understanding and education</li>\n<li>Lack of sufficient desire to change privileged administrative behavior</li>\n<li>Belief that they have other sufficient compensating controls</li>\n</ul>\n<p>And these all really relate to each other – if you don’t understand what a PAW is, you can easily believe other solutions such as PIM or PAM will sufficiently fill the gap. Likewise, if you don’t understand how to articulate the value and principles behind PAW, it’s difficult to run it up the chain to ensure that it has priority. Even in those instances where you may have a decent understanding of PAW, but as an admin don’t want to change your working behavior – it’s understandable, it’s human to not want to change without knowing why.</p>\n<p>Awareness is the first principle of ADKAR (<a href=\"https://www.prosci.com/resources/articles/why-the-adkar-model-works\">The Prosci ADKAR Model: Why it Works</a>). May this article build that awareness, so you’ll come out of it with the second principle, desire.</p>", "image": null, "date_modified": "2025-11-28T21:13:44.339354+00:00", "date_published": "2023-07-17T00:00:00+00:00", "authors": [{"name": "Eric Woodruff"}], "tags": ["Entra ID"]}, {"id": "https://www.ericonidentity.com/2023/06/21/the-noauth-flaw-is-a-symptom-of-industry-antipatterns/", "url": "https://www.ericonidentity.com/2023/06/21/the-noauth-flaw-is-a-symptom-of-industry-antipatterns/", "title": "The nOAuth “flaw” is a symptom of industry antipatterns", "content_html": "<h1>The nOAuth “flaw” is a symptom of industry antipatterns</h1>\n<p>If you haven’t followed the news recently, Descope released an article diving into how their security researchers were able to abuse OpenID Connect (OIDC) ID token claims to spoof the user they are authenticating as for multi-tenant SaaS applications. You can read their research article here, <a href=\"https://www.descope.com/blog/post/noauth\">nOAuth: How Microsoft OAuth Misconfiguration Can Lead to Full Account Takeover (descope.com)</a>.</p>\n<p>In conjunction with this, Microsoft has updated developer guidance for OpenID Connect and SAML assertions, and provided a blog post covering all of this, which can be found here, <a href=\"https://techcommunity.microsoft.com/t5/microsoft-entra-azure-ad-blog/the-false-identifier-anti-pattern/ba-p/3846013\">The False Identifier Anti-pattern (microsoft.com)</a>.</p>\n<p>Multi-tenant SaaS applications are those applications, such as Canva or Sessionize, which allow you to authenticate with your Microsoft or Office 365 account. Without getting off track, this is what allows SaaS application vendors to develop applications that can integrate with an organizations Azure Active Directory environment requiring no effort on the part of administrators.</p>\n<p><img alt=\"Figure 1\" src=\"/images/2023/06/21/img1.png\"></p>\n<p><em>The Sessionize authentication screen allowing a user to select their identity provider.</em></p>\n<p>And as it goes whenever there is a security problem, someone must fall on the sword. In this case Microsoft is taking the hit; unfortunately most new articles are incorrectly reporting on this as an Azure AD “flaw” that Microsoft had to “fix”. Kudos to Kurt Mackie (<a href=\"https://twitter.com/kurmac\">@kurmac</a>) at Redmond Mag for being the only article to accurately report on this problem, which you can find here, <a href=\"https://redmondmag.com/articles/2023/06/21/azure-active-directory-noauth-attack-route.aspx?m=1\">Microsoft Advises App Developers About ‘nOAuth’ Attack Route — Redmondmag.com</a>. To be fair, Microsoft isn’t completely innocent, as it took a case like this to really have them sharpen their guidance from a bit of a softer stance, but this is not really a technical flaw. I suppose we can’t blame others for not wanting to write articles about developers using antipatterns.</p>", "image": null, "date_modified": "2025-11-28T21:13:44.569665+00:00", "date_published": "2023-06-21T00:00:00+00:00", "authors": [{"name": "Eric Woodruff"}], "tags": ["Commentary", "Entra ID"]}, {"id": "https://www.ericonidentity.com/2023/06/20/identiverse-2023-recap-and-highlights/", "url": "https://www.ericonidentity.com/2023/06/20/identiverse-2023-recap-and-highlights/", "title": "Identiverse 2023: Recap And Highlights", "content_html": "<h1>Identiverse 2023: Recap And Highlights</h1>\n<p>Going to a conference like Identiverse is a privilege, even if the travel is funded by airline and hotel miles earned by the feverish pace of pre-COVID travel from my time at Microsoft. The recommendation that every identity and security practitioner should try to attend at least one Identiverse in their career comes with the understanding that the means of doing so could vary greatly. But for those that can – you should absolutely put Identiverse 2024 on your priority list of <strong>big</strong> conferences to attend, especially for those within North America.</p>\n<p>While I take in security content, and sometimes speak at regional events, as an identity practitioner there was no greater clarity provided on some hot topic items than at Identiverse this year. And despite working and living primarily in the Microsoft ecosystem of identity, a few of the most poignant sessions were from those who are not within that ecosystem at all; looking at identity from the angle of a pure practitioner is something that is a growth mindset activity.</p>\n<p><img alt=\"Figure 1\" src=\"/images/2023/06/20/img1.jpeg\"></p>\n<p><em>With my new friend and Entra identity wiz, Chris Brumm (<a href=\"https://twitter.com/cbrhh\">@cbrhh</a>)</em></p>", "image": null, "date_modified": "2025-11-28T21:13:44.215422+00:00", "date_published": "2023-06-20T00:00:00+00:00", "authors": [{"name": "Eric Woodruff"}], "tags": ["Commentary"]}, {"id": "https://www.ericonidentity.com/2023/03/28/march-23rd-2023-the-day-everyone-came-from-uzbekistan/", "url": "https://www.ericonidentity.com/2023/03/28/march-23rd-2023-the-day-everyone-came-from-uzbekistan/", "title": "March 23rd, 2023: The Day Everyone Came From Uzbekistan", "content_html": "<h1>March 23rd, 2023: The Day Everyone Came From Uzbekistan</h1>\n<p>According to Wikipedia, Toshkent (or Tashkent) is the largest city in, as well as the capital of, Uzbekistan, a country located in Central Asia. The city sports a population of 2.9 million people.</p>\n<p>Except for March 23rd, 2023. The day that everyone came from Toshkent City, UZ, at least according to Azure Active Directory.</p>\n<p>!!! note\n    Not necessarily everyone may have been indicated as coming from Toshkent City, but incident MO531859 was globally impacting users.</p>\n<p><img alt=\"Figure 1\" src=\"/images/2023/03/28/img1.png\"></p>\n<p><em>#WeAreAllUzbekistan</em></p>", "image": null, "date_modified": "2025-11-28T21:13:44.297818+00:00", "date_published": "2023-03-28T00:00:00+00:00", "authors": [{"name": "Eric Woodruff"}], "tags": ["Entra ID"]}, {"id": "https://www.ericonidentity.com/2023/03/11/entra-app-registrations-and-enterprise-applications-the-definitive-guide/", "url": "https://www.ericonidentity.com/2023/03/11/entra-app-registrations-and-enterprise-applications-the-definitive-guide/", "title": "Entra App Registrations and Enterprise Applications: The Definitive Guide", "content_html": "<h1>Entra App Registrations and Enterprise Applications: The Definitive Guide</h1>\n<p>For those that must manage application integrations in Entra ID, it’s an inevitable question: What is the difference between an App Registration and an Enterprise Application? Why are there two different management blades? Why do I see some applications in both places?</p>\n<p>I’ll admit that this is not the first take at answering this question, and there are already some good answers out there. Microsoft breaks things down here, <a href=\"https://learn.microsoft.com/en-us/azure/active-directory/develop/app-objects-and-service-principals?WT.mc_id=SEC-MVP-5005105\">Apps &amp; service principals in Azure AD – Microsoft Entra | Microsoft Learn</a>, with a decent visual at the end.</p>\n<p>Marilee Turscak also has an excellent breakdown here, <a href=\"https://marileeturscak.com/posts/app-registrations-enterprise-applications-service-principals/\">The Differences Between App Registrations, Enterprise Applications, and Service Principals in Azure AD | Marilee Turscak</a>.</p>\n<p>And John Savill has fantastic video published covering this as well, <a href=\"https://www.youtube.com/watch?v=WVNvoiA_ktw\">Azure AD App Registrations, Enterprise Apps and Service Principals – YouTube</a>.</p>\n<p>As John points out in his video, the understanding of App Registrations and Enterprise Apps can further be enhanced by understanding OpenID Connect and OAuth 2.0 flows. This is especially important for identity professionals and ITPros who may come from a sysadmin background. Modern authentication flows and concepts may feel foreign to folks who built their career on identity platforms such as Active Directory.</p>\n<p>For those that find it easiest to learn by doing, if you want to play around with App Registrations, Enterprise Apps and Service Principals, but don’t want to mess with your prod environment, sign up for an M365 Developer account, to have your own free tenant to work with here, <a href=\"https://developer.microsoft.com/en-us/microsoft-365/dev-program?WT.mc_id=SEC-MVP-5005105\">Developer Program | Microsoft 365 Dev Center</a>.</p>\n<p>We’ll start with some definitions, and then try to walk through various scenarios that you may encounter. If you don’t see your question answered within the definitions, keep reading… we’ll try to hit on all the areas here.</p>", "image": null, "date_modified": "2025-11-28T21:13:43.349955+00:00", "date_published": "2023-03-11T00:00:00+00:00", "authors": [{"name": "Eric Woodruff"}], "tags": ["Entra ID"]}, {"id": "https://www.ericonidentity.com/2023/02/13/the-importance-of-identity-in-microsoft-certifications/", "url": "https://www.ericonidentity.com/2023/02/13/the-importance-of-identity-in-microsoft-certifications/", "title": "The Importance Of Identity In Microsoft Certifications", "content_html": "<h1>The Importance Of Identity In Microsoft Certifications</h1>\n<p>As I’ve taken Microsoft certification exams, or the exam renewals, I’ve noticed that Azure AD and identity topics are a theme throughout. Now, focusing on the security space, it may seem like somewhat of a given.</p>\n<p>But it made me curious – how many Microsoft certification exams have an identity component to them?</p>\n<p>While the <a href=\"https://learn.microsoft.com/en-us/certifications/browse/?WT.mc_id=SEC-MVP-5005105&amp;products=entra\">Microsoft Certification browser</a> indicates 15 current exams (with four expired) that have a Microsoft Entra product component, the list has some obvious exclusions, such as AZ-900 and MS-900. Granted, those are fundamental exams, but Azure AD and Entra still come up on them in some shape or form.</p>\n<p>I decided to dig a bit deeper, and while I have not sat for the majority of exams outside the security space, the Microsoft official exam guides often give you a good breakdown of the skills and concepts within the exams. I found that 29 exams currently have an identity component to them, that would have an estimated weight of at least 5%.</p>", "image": null, "date_modified": "2025-11-28T21:13:44.477066+00:00", "date_published": "2023-02-13T00:00:00+00:00", "authors": [{"name": "Eric Woodruff"}], "tags": ["Entra ID"]}, {"id": "https://www.ericonidentity.com/2023/02/06/dont-let-dns-be-your-azure-ad-recovery-downfall/", "url": "https://www.ericonidentity.com/2023/02/06/dont-let-dns-be-your-azure-ad-recovery-downfall/", "title": "Don't Let DNS Be Your Azure AD Recovery Downfall", "content_html": "<h1>Don't Let DNS Be Your Azure AD Recovery Downfall</h1>\n<p>In September of 2022, Joey Verlinden (<a href=\"https://twitter.com/jvldn1\">@jvldn1</a>) published an excellent article on his experience with recovering access to an Azure AD tenant that he was completely locked out of. You can, and should, read the full article here, <a href=\"https://www.joeyverlinden.com/what-happens-if-you-lock-out-your-azure-tenant/\">What happens if you lock-out your Azure Tenant? – Joey Verlinden</a>.</p>\n<p>In this, Joey details the process for recovering access to an Azure AD tenant, which includes a detailed verification process, which is rightfully put in place to ensure that someone isn’t capable of a tenant takeover through social engineer. As part of the process, the request is verified by means of either:</p>\n<ul>\n<li>Calling the phone number associated with a Tenant</li>\n<li>Emailing a Global Administrator</li>\n<li>Requesting that the organization creates a DNS TXT record associated with one of the verified domains</li>\n</ul>\n<p>Now, under normal “oops” scenarios, you likely could use a phone call or email to a Global Administrator. Of course, if a GA is mail-enabled, the email should be forwarded, as your Global Admins should not actually be receiving or checking email directly in that inbox (which is a different story).</p>", "image": null, "date_modified": "2025-11-28T21:13:44.017543+00:00", "date_published": "2023-02-06T00:00:00+00:00", "authors": [{"name": "Eric Woodruff"}], "tags": ["Entra ID"]}, {"id": "https://www.ericonidentity.com/2023/01/29/azure-ad-101-azure-subscription-relationship/", "url": "https://www.ericonidentity.com/2023/01/29/azure-ad-101-azure-subscription-relationship/", "title": "Azure AD 101: Azure Subscription Relationship", "content_html": "<h1>Azure AD 101: Azure Subscription Relationship</h1>\n<p>Whether you are dipping your toe or diving headfirst into Azure, one of the points of confusion is the relationship between Azure Active Directory and Azure subscriptions. Azure subscriptions may be referred to as subscriptions, or sometimes even just Azure. An Azure Active Directory tenant, which is the cloud identity provider, is usually referred to as Azure AD or AAD, or sometimes just tenant.</p>\n<p>While Microsoft has decent documentation on the relationship, I tend to find that drawing analogies along with additional visuals can help really drive the relationship home for folks. For the MS Docs article, see <a href=\"https://learn.microsoft.com/en-us/azure/active-directory/fundamentals/active-directory-how-subscriptions-associated-directory?WT.mc_id=SEC-MVP-5005105\">Add an existing Azure subscription to your tenant – Azure AD – Microsoft Entra | Microsoft Learn</a>.</p>", "image": null, "date_modified": "2025-11-28T21:13:43.514810+00:00", "date_published": "2023-01-29T00:00:00+00:00", "authors": [{"name": "Eric Woodruff"}], "tags": ["Azure", "Entra ID"]}, {"id": "https://www.ericonidentity.com/2023/01/16/cloud-identity-is-still-the-future/", "url": "https://www.ericonidentity.com/2023/01/16/cloud-identity-is-still-the-future/", "title": "Cloud Identity Is Still The Future", "content_html": "<h1>Cloud Identity Is Still The Future</h1>\n<p>In October 2022, the CTO of 37signals, David Heinemeier Hansson, published a piece on why hey.com was leaving the cloud. You can read the full article here, <a href=\"https://world.hey.com/dhh/why-we-re-leaving-the-cloud-654b47e0\">Why we’re leaving the cloud (hey.com)</a>; the gist of the post is that cloud is not cost-effective. More recently, InfoWorld published a piece by David Linthicum, <a href=\"https://www.infoworld.com/article/3684369/2023-could-be-the-year-of-public-cloud-repatriation.html\">2023 could be the year of public cloud repatriation | InfoWorld</a>, hitting on why it may be more cost-effective to move back to private data centers. You see the trend – cloud may not be providing the ROI that is expected, especially if your organization has just performed a bunch of lift-and-shift without application refactoring.</p>\n<p>While the titles are attention grabbing, and the articles have valid points, they don’t really tell the full story. Folks in the industry may scan the headlines and believe that a mass cloud exodus is on the verge of happening, but we really need to look at what part of the cloud we are speaking to. We need to distinguish between IaaS, PaaS and SaaS, as well as related services and systems, such as IDaaS (identity as a service, aka Azure AD, Okta, and so on).</p>", "image": null, "date_modified": "2025-11-28T21:13:43.979438+00:00", "date_published": "2023-01-16T00:00:00+00:00", "authors": [{"name": "Eric Woodruff"}], "tags": ["Commentary"]}, {"id": "https://www.ericonidentity.com/2022/12/19/spaml-spoofing-users-in-azure-ad-with-saml-claims-transformations/", "url": "https://www.ericonidentity.com/2022/12/19/spaml-spoofing-users-in-azure-ad-with-saml-claims-transformations/", "title": "SpAML: Spoofing Users In Azure AD With SAML Claims Transformations", "content_html": "<h1>SpAML: Spoofing Users In Azure AD With SAML Claims Transformations</h1>\n<p>For those that believe SAML is dead, they should take a look at the Azure AD Application Gallery. While the authentication standard finished baking almost two decades ago, it’s still a staple for integration of applications with Azure AD. As of writing, the Azure AD App Gallery has 2015 applications available for SSO integration, and 1335 of them use SAML, roughly two-thirds. Beyond this, there are thousands of line-of-business (LOB) and other 3rd party applications that don’t exist in the gallery but leverage SAML. Many well-known applications and platforms are published in the gallery using SAML – Salesforce, Google Workspace/Google Cloud, AWS, SAP, Oracle Cloud, ServiceNow, Workday… the list goes on and on.</p>\n<p>With the ease of federated identity, not only are we tying other cloud providers to Azure AD, but we are also bringing in business critical applications. With this, we need to keep in mind that threat actors are not always targeting critical IT resources; one can do plenty damage with access to records and data stored within SaaS applications.</p>\n<p>Azure AD makes it easier than ever to spoof (impersonate) a user within a SAML response. This relatively easy technique allows us to impersonate a highly privileged user in the target application. At the same time, authentication behavior for all other users of the application, including the legitimate user being spoofed, will not change. If your organization leverages SCIM for user provisioning, which is the direction the industry is going, this lends in favor of spoofing going undetected, as optional attributes in the SAML response will go unused by the application.</p>\n<p>Within Azure AD, you do not need to be a Global Administrator to configure an Enterprise Application. Anyone with Application Administrator, Cloud Application Administrator, or assigned Owner to a specific application can manage it. From a usability perspective, Microsoft pushes delegation of ownership to the business units. The users, however, that now can manage the application, likely fall under the bar of PIM or any privilege separation. Suffice to say, this opens our potential pool of targets in an organization; needing Global Administrator for movement into target applications is not necessary, just whoever has ownership. Likewise, it’s ripe for abuse by insider threats.</p>", "image": null, "date_modified": "2025-11-28T21:13:44.382839+00:00", "date_published": "2022-12-19T00:00:00+00:00", "authors": [{"name": "Eric Woodruff"}], "tags": ["Entra ID", "Security Research"]}, {"id": "https://www.ericonidentity.com/2022/12/02/field-notes-migration-from-federation-to-cloud-authentication/", "url": "https://www.ericonidentity.com/2022/12/02/field-notes-migration-from-federation-to-cloud-authentication/", "title": "Field Notes: Migration From Federation To Cloud Authentication", "content_html": "<h1>Field Notes: Migration From Federation To Cloud Authentication</h1>\n<p>During my stint at Microsoft, I spent a good deal of time with Windows Hello for Business (WHfB), and subsequently would be involved in prerequisite work to set the stage. For the enablement of WHfB, one of these items is device join, and it usually would be Hybrid Azure AD Join (HAADJ) for existing devices already within Active Directory. Device join can be a bit of a rabbit hole if the organization has federated authentication with AD FS in place, as there are different ways you can configure the device join process.</p>\n<p>One customer I was working with decided that they wanted to use their WHfB prerequisite work as the same point to switch from federated to cloud authentication with PHS; they were already sending their passwords to Azure AD for use with Azure AD Identity Protection. I discussed high-level what was required to switch but figured the conversation would continue after lunch. Instead, the customer decided to implement the switch during lunch, and their thousand or so users were moved to cloud authentication, with relatively little planning.</p>\n<p>Luckily their environment was relatively straightforward from an identity architecture perspective; I wouldn’t recommend going into the switch without more thorough planning. But the point being made here is that the actual period of cutover has a much lower actual risk than perceived risk.</p>", "image": null, "date_modified": "2025-11-28T21:13:44.174175+00:00", "date_published": "2022-12-02T00:00:00+00:00", "authors": [{"name": "Eric Woodruff"}], "tags": ["AD FS"]}, {"id": "https://www.ericonidentity.com/2022/10/16/cisa-scuba-diving-into-the-azure-ad-baseline/", "url": "https://www.ericonidentity.com/2022/10/16/cisa-scuba-diving-into-the-azure-ad-baseline/", "title": "CISA SCuBA: Diving Into The Azure AD Baseline", "content_html": "<h1>CISA SCuBA: Diving Into The Azure AD Baseline</h1>\n<p>CISA recently released baseline guidance for cloud application security, dubbed SCuBA, or Secure Cloud Business Applications. Within this guidance they cover the M365 and Google Workspace stacks, and they have also released the ScubaGear tool, which you can find here, <a href=\"https://github.com/cisagov/ScubaGear\">cisagov/ScubaGear: Automation to assess the state of your M365 tenant against CISA’s baselines (github.com)</a>. The ScubaGear tool provides the ability to run an assessment against a targeted M365 environment against baselines. I’ve tested the ScubaGear tool against the Azure AD baseline, and it works well enough, but for the purposes of this post I’m targeting the baseline itself.</p>\n<p>When released, there is the natural curiosity to see where things intersect with CISA recommendations, Microsoft recommendations, and what actually works out in the real world. I saw some folks on Twitter commenting that this could be potentially a great tool for analysis for all sorts of commercial and public organizations, big and small. But do the recommendations from, and for, the Federal Government align to what most organizations really need?</p>\n<p>I’ll be taking a look at each baseline policy as defined and providing analysis on it specific to the context of its applicability outside of government scenarios. I’ll be going through in order as written, and then providing a final take. Note that for ease the header numbering aligns to the baseline.</p>\n<p>If you’re curious to obtain the baseline, CISA has it available as a PDF found here, <a href=\"https://www.cisa.gov/sites/default/files/publications/Microsoft%20Azure%20Active%20Directory%20M365%20Minimum%20Viable%20SCB%20Draft%20v0.1.pdf\">Microsoft Azure Active Directory PDF</a>. There is also a markdown version on Github that is easier to consume, found here, <a href=\"https://github.com/cisagov/ScubaGear/blob/main/baselines/aad.md\">ScubaGear/aad.md at main · cisagov/ScubaGear (github.com)</a>. As I’m only providing reference to the policy itself, I’ll point out that the CISA documents in either format also provide useful license requirement information and details on implementation, which are mostly links to Microsoft Docs Learn articles.</p>\n<p>Content between policy definition header and analysis is provided from CISA recommendations. Content after colored Analysis header to next recommendation is my analysis.</p>", "image": null, "date_modified": "2025-11-28T21:13:43.940601+00:00", "date_published": "2022-10-16T00:00:00+00:00", "authors": [{"name": "Eric Woodruff"}], "tags": ["Entra ID"]}, {"id": "https://www.ericonidentity.com/2022/10/12/vm-contributor-to-domain-admin-in-60-seconds/", "url": "https://www.ericonidentity.com/2022/10/12/vm-contributor-to-domain-admin-in-60-seconds/", "title": "VM Contributor To Domain Admin In 60 Seconds", "content_html": "<h1>VM Contributor To Domain Admin In 60 Seconds</h1>\n<p>When Microsoft revamped the privileged access model in the late fall of 2020, it was received with mixed results. To some, it felt as if it was overcomplicating the simple three-tier model that had been the gold standard for protecting Active Directory and other critical business assets for about a decade.</p>\n<p>However, the shift was necessary, as it was acknowledging that business critical assets are not just the identity provider. The revamp changed how we look at things, with the proliferation of virtualization and cloud providers, and pointing out the management and control plane as critical privileged points of access.</p>\n<p><img alt=\"Figure 1\" src=\"/images/2022/10/12/img1.png\"></p>\n<p><em>The modern Enterprise access model, courtesy Microsoft</em></p>\n<p>It’s quite a common pattern to extend Active Directory to Azure as the initial standup of infrastructure out there, to support all the other “things” dependent on it.</p>\n<p>But as it goes with the cloud, there are new vectors to be on the watch for, and in this case, it’s ensuring that your RBAC permissions over Tier 0 assets in Azure are properly defined.</p>", "image": null, "date_modified": "2025-11-28T21:13:44.615232+00:00", "date_published": "2022-10-12T00:00:00+00:00", "authors": [{"name": "Eric Woodruff"}], "tags": ["Active Directory", "Azure", "Entra ID"]}, {"id": "https://www.ericonidentity.com/2022/10/05/azure-ad-new-controls-for-authentication-strength/", "url": "https://www.ericonidentity.com/2022/10/05/azure-ad-new-controls-for-authentication-strength/", "title": "Azure AD: New Controls For Authentication Strength", "content_html": "<h1>Azure AD: New Controls For Authentication Strength</h1>\n<p>Microsoft has released a much asked for setting, which also aligns to the Whitehouse memorandum, M-22-09, calling for federal agencies to require phishing resistant MFA by 2024, you can read the full memorandum here, <a href=\"https://www.whitehouse.gov/wp-content/uploads/2022/01/M-22-09.pdf\">M-22-09 Federal Zero Trust Strategy (whitehouse.gov)</a>.</p>\n<p>With this, we now have granularity in Conditional Access to not just specify whether MFA is required, but also how strong the collective authentication is.</p>", "image": null, "date_modified": "2025-11-28T21:13:43.683605+00:00", "date_published": "2022-10-05T00:00:00+00:00", "authors": [{"name": "Eric Woodruff"}], "tags": ["MFA"]}, {"id": "https://www.ericonidentity.com/2022/09/08/choosing-a-fido2-security-key/", "url": "https://www.ericonidentity.com/2022/09/08/choosing-a-fido2-security-key/", "title": "Choosing a FIDO2 Security Key", "content_html": "<h1>Choosing a FIDO2 Security Key</h1>\n<p>As I’ve been keeping up with my FIDO2 Security Key roundup, which you can find here, <a href=\"https://ericonidentity.com/2022/05/18/azure-ad-fido2-security-key-roundup-and-review/\">Azure AD: FIDO2 Security Key Roundup and Review – Eric on Identity</a>, I’ve had some folks on occasion ask me what key(s) I would recommend.</p>\n<p>In the roundup, while it’s hard to not inject some subjectivity, I try to stay objective, hence my reason to not score/rank the keys. Also, that would be a lot more work.</p>\n<p>At the end of this article, I still won’t have provided a ranking of everything out there, but hope the points indicated within can help organizations make some informed decisions.</p>\n<p><em>Note that any lists included within are in brand alphabetical order and does not indicate an order of preference.</em></p>", "image": null, "date_modified": "2025-11-28T21:13:43.877373+00:00", "date_published": "2022-09-08T00:00:00+00:00", "authors": [{"name": "Eric Woodruff"}], "tags": ["FIDO2", "Passwordless"]}]}