{"config":{"lang":["en"],"separator":"[\\s\\-]+","pipeline":["stopWordFilter"]},"docs":[{"location":"2025/02/20/an-interesting-m365-billing-scam/","title":"An Interesting M365 Billing Scam","text":""},{"location":"2025/02/20/an-interesting-m365-billing-scam/#update","title":"Update","text":"<p>I called the 888 number this morning and it does indeed go to a scam call center. I played along with the person on the other end, who ultimately wanted my first and last name, email address, the order number, and most importantly, my credit card number, so they \u201ccould reverse the charge\u201d \ud83e\udd23</p>"},{"location":"2025/02/20/an-interesting-m365-billing-scam/#the-scam","title":"The Scam","text":"<p>This is a case where I\u2019d actually love to see how this plays out \u2013 when you see the way that scammers try to string things together. I\u2019ve been receiving a rash of unpaid toll bill texts, which give themselves away pretty easily based on the source number. But I\u2019m not here to talk about that scam.</p> <p>Instead, I\u2019m here to dig into this email I received last week:</p> <p></p> <p>Last time I checked, I\u2019m not Molly Wagner</p> <p>It looked authentic, and when I checked the headers, it is indeed from Microsoft. I do subscribe to various Microsoft services and receiving emails like this are not abnormal, but I was certainly confused by the service, as well as who it was to.</p> <p>I scroll down a bit more into the rest of the email:</p> <p></p> <p>Notice anything unusual? At first, I didn\u2019t. To give myself props, even though it all seemed legitimate, I didn\u2019t click on the link.</p> <p>But when I saw the domain JacksonLyons.onmicrosoft.com I decided to go look it up over at https://aadinternals.com/osint/. The results:</p> Property Value Default domain JacksonLyons.onmicrosoft.com Tenant name null Tenant brand Microsoft We appreciate your purchase and have finished your recent order for 592.99 USD. Please contact us at (888) 929-1904 for help or cancelation. Tenant id 6cc54dbc-77fb-44e7-9c6f-ca766a8e26b1 Tenant region NA Seamless single sign-on (SSSO) disabled Uses Azure AD Connect cloud sync N/A Certificate-based authentication (CBA) N/A <p>The results make me wonder if the tenant is turned off on the Microsoft side, as there are no verified domains, but there is a Tenant ID, and the interesting Tenant brand.</p> <p>Of course, it appears that smithkrause.onmicrosoft.com is the vehicle behind this, and in particular mollywagner@smithkrause.onmicrsoft.com.</p> <p>Back to another lookup courtesy of @drazuread.bksy.social:</p> Property Value Default domain SmithKrause.onmicrosoft.com Tenant name SmithKrause.onmicrosoft.com Tenant brand SmithKrause Tenant id eecfe604-36e5-4e7c-86ee-2313e05112aa Tenant region NA Seamless single sign-on (SSSO) disabled Uses Azure AD Connect cloud sync N/A Certificate-based authentication (CBA) N/A Verified domains 2 Domain Type STS addiamaryellen.gigasphere.site Managed SmithKrause.onmicrosoft.com Managed <p>Pulling a whois of gigasphere.site, the domain is relatively fresh:</p> <pre><code>Domain Name: GIGASPHERE.SITE\nRegistry Domain ID: D524536986-CNIC\nRegistrar WHOIS Server: whois.namecheap.com\nRegistrar URL: https://namecheap.com\nUpdated Date: 2025-02-05T10:49:53.0Z\nCreation Date: 2025-02-05T10:49:48.0Z\nRegistry Expiry Date: 2026-02-05T23:59:59.0Z\nRegistrar: Namecheap\nRegistrar IANA ID: 1068\n</code></pre> <p>When digging into DNS, both gigasphere.site and addiamaryellen.gigasphere.site only have MX and SPF records for EXO (gigasphere.site DNS is hosted by Cloudflare).</p> <p>Of course, the email originated from a smithkrause.onmicrosoft.com domain, which I can\u2019t tell the age of, or at least not through AAD Internals OSINIT. Another interesting thing to note is that the people behind the scam are populating a distribution list with the target email addresses; when looking at the headers the To: is indeed mollywagner@smithkrause.onmicrosoft.com.</p> <p>In due diligence I submitted the email review in M365 Defender, which came back with a no threats found</p> <p></p> <p>Apparently, the body of the email containing \"Microsoft We appreciate your purchase and have finished your recent order for 592.99 USD. Please contact us at (888) 929-1904 for help or cancelation.\" isn\u2019t sufficient enough to be considered suspicious \ud83d\ude44.</p> <p>For fun, I did call the number, but right now the scammers number just forwards to a voicemail box; if I\u2019m able to get ahold of them and resolve my billing issues I\u2019ll follow up \ud83d\ude09.</p> <p>And the link? The link is benign, it just goes to the M365 admin billing portal, because the email as far as I can tell is legit from Microsoft.</p> <p>The first few hops on the headers appear to be coming from some MS backend service and it hits the DL on hop 5, based on looking at the headers on https://mxtoolbox.com/EmailHeaders.aspx:</p> Hop Delay From By With Time (UTC) Blacklist 1 * outlook.office365.com 2603:10b6:303:18d::16 MW4PR20MB4527.namprd20.prod.outlook.com HTTP 2/13/2025 2:40:06 PM \u2705 2 2 seconds NAM10-DM6-obe.outbound.protection.outlook.com 2a01:111:f403:2413::720 SJ1PEPF00002313.mail.protection.outlook.com 2603:10b6:a0f:fc02::1a7 Microsoft SMTP Server (version=TLS1_3, cipher=TLS_AES_256_GCM_SHA384) 2/13/2025 2:40:08 PM \u2705 3 0 seconds SJ1PEPF00002313.namprd03.prod.outlook.com 2603:10b6:a03:54:cafe::b3 BYAPR02CA0055.outlook.office365.com 2603:10b6:a03:54::32 Microsoft SMTP Server (version=TLS1_3, cipher=TLS_AES_256_GCM_SHA384) 2/13/2025 2:40:08 PM \u2705 4 0 seconds BYAPR02CA0055.namprd02.prod.outlook.com 2603:10b6:a03:54::32 SJ2PR17MB6565.namprd17.prod.outlook.com 2603:10b6:a03:4f6::19 Microsoft SMTP Server (version=TLS1_2, cipher=TLS_ECDHE_RSA_WITH_AES_256_GCM_SHA384) 2/13/2025 2:40:08 PM \u2705 5 47 seconds BY5PR17MB3063.namprd17.prod.outlook.com fe80::bf8c:c1de:31b1:4af5 BY5PR17MB3063.namprd17.prod.outlook.com fe80::bf8c:c1de:31b1:4af5 mapi 2/13/2025 2:40:55 PM \u274c <p>Additionally, I would think if the email was fake, they wouldn\u2019t include a legit link to the M365 Admin billing site.</p> <p>Here is what I believe is going on:</p> <ol> <li>Scammer sets up junk tenant with the scam text tenant brand info</li> <li>Distribution list is created with target email addresses</li> <li>DL is used as the billing contact email</li> <li>Scammer signs up for trial and/or service (not sure of this part in that when I looked up Dynamics 365 Sales Enterprise Edition, it\u2019s $120 USD /month)</li> <li>Email is blasted to all the targets via the DL</li> </ol> <p>Anyway, I thought it was worth a share as this seems like a new twist on using Microsoft tools to try and scam people.</p> <p>In the meantime, I\u2019ll be trying to poke at Microsoft people to take down the smithkrause domain.</p>"},{"location":"2023/08/29/dude-wheres-my-audit-logs/","title":"Dude, Where's My Audit Logs?","text":"<p>Audit logs can provide all sorts of wonderful points of data. In the interest of identity security, we have historically seen that we can glean rich sets of information around what\u2019s happening in a directory service with some properly functioning audit logging. For many identity practitioners, there is the expectation that while we may not always look at the audit logs or their details, if or when we need them, they\u2019ll be there to help us understand whatever it is we are investigating. Same goes for compliance and auditing as well.</p> <p>Considering that customers have no ability to impact what or how auditing happens in Entra ID, in the shared responsibility model, it\u2019s on Microsoft to ensure all events are audited.</p> <p> Shared responsiblity model, courtesy Microsoft, with identity and directory infrastructure highlighted.</p> <p>Microsoft documents what is audited in Entra ID, which you can find here, Azure Active Directory (Azure AD) audit activity reference \u2013 Microsoft Entra | Microsoft Learn.</p>"},{"location":"2023/08/29/dude-wheres-my-audit-logs/#the-problem","title":"The problem","text":"<p>I\u2019ve recently been down the rabbit hole part time picking apart Entra ID audit logs, and in my analysis of the audit log data for Entra ID, some audit logs slot into one of two buckets:</p> <ul> <li>Data is missing</li> <li>Data is inconsistent/poor quality</li> </ul> <p> Or perhaps in our case, what has been unseen cannot be seen.</p> <p>To be fair, a broad set of changes are audited in Entra ID, but at the same time I found it rather surprising that most SSPR configuration changes are not properly audited, which, if you look at the document above, Microsoft does not seem to argue. Considering recent events that surface what is logged in Entra ID and the M365 ecosystem, in this persons opinion Microsoft should be continually striving to audit 100% of all configuration changes in Entra ID.</p>"},{"location":"2023/08/29/dude-wheres-my-audit-logs/#missing-log-data","title":"Missing log data","text":"<p>These are instances where Entra ID log data is incomplete, usually in that the modified properties data is null.</p>"},{"location":"2023/08/29/dude-wheres-my-audit-logs/#self-service-group-management","title":"Self-service group management","text":"<p>Neither of these settings are exposed via the Graph API, so the reference point for their control is under Entra ID -&gt; Groups -&gt; Group settings</p> <p></p>"},{"location":"2023/08/29/dude-wheres-my-audit-logs/#the-audit-data","title":"The audit data","text":"<p>Note an absence of the actual change data, as highlighted in the audit event:</p> <pre><code>{\n        \"activityDateTime\": \"2023-08-07T20:04:39.1390262+00:00\",\n        \"activityDisplayName\": \"Update authorization policy\",\n        \"additionalDetails\": [\n            {\n                \"key\": \"User-Agent\",\n                \"value\": \"Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/116.0\"\n            }\n        ],\n        \"category\": \"AuthorizationPolicy\",\n        \"correlationId\": \"1349713e-116b-4246-9c64-60b394884488\",\n        \"id\": \"Directory_1349713e-116b-4246-9c64-60b394884488_NANEA_29121908\",\n        \"initiatedBy\": {\n            \"user\": {\n                \"displayName\": null,\n                \"homeTenantId\": null,\n                \"homeTenantName\": null,\n                \"id\": \"d7148226-7444-4884-aef7-b5fe693a6798\",\n                \"ipAddress\": \"X.X.X.X\",\n                \"userPrincipalName\": \"ga-x@x.onmicrosoft.com\"\n            }\n        },\n        \"loggedByService\": \"Core Directory\",\n        \"result\": \"success\",\n        \"resultReason\": \"\",\n        \"targetResources\": [\n            {\n                \"displayName\": \"Authorization Policy\",\n                \"groupType\": null,\n                \"id\": \"4bb7b039-71e4-474e-a7fc-5fe0bbf86fcc\",\n                \"modifiedProperties\": [\n                    {\n                        \"displayName\": \"Included Updated Properties\",\n                        \"newValue\": \"\\\"\\\"\",\n                        \"oldValue\": null\n                    }\n                ],\n                \"type\": \"Other\",\n                \"userPrincipalName\": null\n            }\n        ],\n        \"userAgent\": null\n    },\n    ```\n\n    ### Group lifecycle policy changes\n\n    More commonly known as the group expiration settings, the controls for these in the portal can be found under Groups -&gt; Group settings -&gt; Expiration.\n\n    ![Figure 4](/images/2023/08/29/img4.png)\n\n    These are also exposed through Graph, [https://graph.microsoft.com/beta/groupLifecyclePolicies/](https://graph.microsoft.com/beta/groupLifecyclePolicies/).\n\n    The audit data\n\n    Note the absence of any change data, as highlighted in the audit event:\n\n    ```\n    {\n        \"activityDateTime\": \"2023-08-07T20:09:38.6970558+00:00\",\n        \"activityDisplayName\": \"Update lifecycle management policy\",\n        \"additionalDetails\": [\n        ],\n        \"category\": \"GroupManagement\",\n        \"correlationId\": \"8883b045-774b-4107-b85a-04df5252b5ad\",\n        \"id\": \"SSGM_8883b045-774b-4107-b85a-04df5252b5ad_KLKOT_36197055\",\n        \"initiatedBy\": {\n            \"user\": {\n                \"displayName\": null,\n                \"homeTenantId\": null,\n                \"homeTenantName\": null,\n                \"id\": \"d7148226-7444-4884-aef7-b5fe693a6798\",\n                \"ipAddress\": \"X.X.X.x\",\n                \"userPrincipalName\": \"ga-x@x.onmicrosoft.com\"\n            }\n        },\n        \"loggedByService\": \"Self-service Group Management\",\n        \"result\": \"success\",\n        \"resultReason\": \"OK\",\n        \"targetResources\": [\n            {\n                \"displayName\": null,\n                \"groupType\": null,\n                \"id\": \"57126178-623b-4468-a96e-be2ee1611cc4\",\n                \"modifiedProperties\": [\n                ],\n                \"type\": \"Policy\",\n                \"userPrincipalName\": null\n            }\n        ],\n        \"userAgent\": null\n    },\n    ```\n\n    ### Conditional Access custom controls\n\n    Now I get that this is a deprecated public preview, but, it\u2019s also existed for quite a long time, and it\u2019s surprising that changes to the control itself are not audited.\n\n    #### The audit data\n\n    Note the absence of any change data, as highlighted in the audit event:\n\n    ```\n    {\n        \"activityDateTime\": \"2023-08-07T20:18:39.6114596+00:00\",\n        \"activityDisplayName\": \"Update policy\",\n        \"additionalDetails\": [\n        ],\n        \"category\": \"Policy\",\n        \"correlationId\": \"21476eae-1b3f-45db-8e3e-e190cd19ad44\",\n        \"id\": \"Directory_21476eae-1b3f-45db-8e3e-e190cd19ad44_USKAS_28366729\",\n        \"initiatedBy\": {\n            \"user\": {\n                \"displayName\": null,\n                \"homeTenantId\": null,\n                \"homeTenantName\": null,\n                \"id\": \"d7148226-7444-4884-aef7-b5fe693a6798\",\n                \"ipAddress\": \"X.X.X.X\",\n                \"userPrincipalName\": \"ga-x@x.onmicrosoft.com\"\n            }\n        },\n        \"loggedByService\": \"Core Directory\",\n        \"result\": \"success\",\n        \"resultReason\": \"\",\n        \"targetResources\": [\n            {\n                \"displayName\": \"Default Policy\",\n                \"groupType\": null,\n                \"id\": \"77a1c6e8-877e-43fe-a4d0-0806472fe4a0\",\n                \"modifiedProperties\": [\n                    {\n                        \"displayName\": \"Included Updated Properties\",\n                        \"newValue\": \"\\\"\\\"\",\n                        \"oldValue\": null\n                    }\n                ],\n                \"type\": \"Policy\",\n                \"userPrincipalName\": null\n            }\n        ],\n        \"userAgent\": null\n    },\n</code></pre>"},{"location":"2023/08/29/dude-wheres-my-audit-logs/#ssprpassword-reset-settings","title":"SSPR/Password Reset Settings","text":"<p>Microsoft documents that most changes to SSPR are not audited, and in my analysis found that the following settings do not properly reflect any data in the audit logs, including a few that Microsoft seems to indicate should, such as enabling/disabling on-premises integration.</p> <p>Considering that these changes impact tenant-wide security controls around SSPR, it\u2019s surprising this service has existed for so long with what is effectively non-existent auditing. These logs don\u2019t even indicate who initiated the change.</p> <p>Yes, some of these are being overhauled/changed as authentication methods is an area of focus for Microsoft right now, but not all of these settings are encompassed in that.</p> <ul> <li>Registration, Days before users are asked to re-confirm their settings</li> <li>Notification settings</li> <li>Customizations</li> <li>On-premises integration</li> <li>Self-service password reset enablement/scoping</li> <li>Authentication methods (legacy methods)</li> </ul>"},{"location":"2023/08/29/dude-wheres-my-audit-logs/#the-audit-data_1","title":"The audit data","text":"<p>In testing, there isn\u2019t even a direct audit event logged for changes, but simply an update to the Microsoft password reset service service principle. The update provides no information on the actual change.</p> <pre><code>{\n        \"activityDateTime\": \"2023-08-07T20:28:04.2244435+00:00\",\n        \"activityDisplayName\": \"Update service principal\",\n        \"additionalDetails\": [\n            {\n                \"key\": \"AppId\",\n                \"value\": \"93625bc8-bfe2-437a-97e0-3d0060024faa\"\n            }\n        ],\n        \"category\": \"ApplicationManagement\",\n        \"correlationId\": \"aae6519f-15d9-4dec-9d12-a03b2639c60e\",\n        \"id\": \"Directory_aae6519f-15d9-4dec-9d12-a03b2639c60e_F0I2G_33925192\",\n        \"initiatedBy\": {\n            \"app\": {\n                \"appId\": null,\n                \"displayName\": \"Microsoft password reset service\",\n                \"servicePrincipalId\": \"a96c060c-dd1c-4229-9089-72aed43d85db\",\n                \"servicePrincipalName\": null\n            }\n        },\n        \"loggedByService\": \"Core Directory\",\n        \"result\": \"success\",\n        \"resultReason\": \"\",\n        \"targetResources\": [\n            {\n                \"displayName\": \"Microsoft password reset service\",\n                \"groupType\": null,\n                \"id\": \"a96c060c-dd1c-4229-9089-72aed43d85db\",\n                \"modifiedProperties\": [\n                    {\n                        \"displayName\": \"TargetId.ServicePrincipalNames\",\n                        \"newValue\": \"\\\"https://passwordreset.microsoftonline.com;https://passwordreset.microsoftonline.com/;93625bc8-bfe2-437a-97e0-3d0060024faa\\\"\",\n                        \"oldValue\": null\n                    }\n                ],\n                \"type\": \"ServicePrincipal\",\n                \"userPrincipalName\": null\n            }\n        ],\n        \"userAgent\": null\n    },\n</code></pre>"},{"location":"2023/08/29/dude-wheres-my-audit-logs/#external-identities-linked-subscriptions","title":"External Identities linked subscriptions","text":"<p>Microsoft has been pushing the migration of B2B guests/External Identities to use a linked subscription where organizations will receive 50,000 MAU for guests as far as licensing goes, compared to the prior model of a 1:5 user: guest license ratio.</p> <p>In order to implement this change, an organization must link their Entra ID tenant with an Azure subscription for billing purposes.</p> <p>When implementing this change, there is a proper audit even in the subscriptions activity log, however, a change like this should also be reflected in Entra ID audit logs. Instead, we get a series of useless audit log entries.</p>"},{"location":"2023/08/29/dude-wheres-my-audit-logs/#the-audit-data_2","title":"The audit data","text":"<p>When looking at the data in either entry for Create or update a Guest Usages resource, there is no data of value for the change.</p> <pre><code>{\n        \"activityDateTime\": \"2023-08-07T20:38:06.5858394+00:00\",\n        \"activityDisplayName\": \"Create or update a Guest Usages resource\",\n        \"additionalDetails\": [\n            {\n                \"key\": \"targetTenant\",\n                \"value\": \"Undefined tenant\"\n            },\n            {\n                \"key\": \"targetEntityType\",\n                \"value\": \"Resource\"\n            },\n            {\n                \"key\": \"actorIdentityType\",\n                \"value\": \"UPN\"\n            }\n        ],\n        \"category\": \"ResourceManagement\",\n        \"correlationId\": \"dda8b5c0-125d-4fc6-b8aa-971e9cb27f9a\",\n        \"id\": \"B2C_dda8b5c0-125d-4fc6-b8aa-971e9cb27f9a_VUR48_6835487\",\n        \"initiatedBy\": {\n            \"user\": {\n                \"displayName\": \"ga-x@x.onmicrosoft.com\",\n                \"homeTenantId\": null,\n                \"homeTenantName\": null,\n                \"id\": null,\n                \"ipAddress\": \"X.X.X.X\",\n                \"userPrincipalName\": \"ga-x@x.onmicrosoft.com\"\n            }\n        },\n        \"loggedByService\": \"B2C\",\n        \"result\": \"success\",\n        \"resultReason\": null,\n        \"targetResources\": [\n            {\n                \"displayName\": \"NotSet\",\n                \"groupType\": null,\n                \"id\": null,\n                \"modifiedProperties\": [\n                ],\n                \"type\": \"Directory\",\n                \"userPrincipalName\": null\n            }\n        ],\n        \"userAgent\": null\n    },\n</code></pre>"},{"location":"2023/08/29/dude-wheres-my-audit-logs/#external-collaboration-settings-guest-self-service-sign-up-via-user-flows","title":"External collaboration settings guest self-service sign up via user flows","text":"<p>Guest self-service sign-up (SSSU) is what one could consider a grey area in the B2B/B2C space, allowing users to self-register as guests in your tenant and access designated resources. While a somewhat niche feature, it\u2019s something that is rather powerful for controlling access to enterprise applications.</p> <p></p> <p>This setting can also be adjusted via Graph at https://graph.microsoft.com/v1.0/policies/authenticationFlowsPolicy.</p> <p>Surprisingly, changes that enable/disable this setting are not audited effectively.</p>"},{"location":"2023/08/29/dude-wheres-my-audit-logs/#the-audit-data_3","title":"The audit data","text":"<p>Toggling this on/off results in a long series of audit events from the B2C service, however, none of them actually indicate the change.</p> <p></p> <p>For all of these, the Modified Properties is null</p> <pre><code>{\n        \"activityDateTime\": \"2023-08-07T20:49:50.9366119+00:00\",\n        \"activityDisplayName\": \"Update authentication flows policy\",\n        \"additionalDetails\": [\n            {\n                \"key\": \"targetTenant\",\n                \"value\": \"Undefined tenant\"\n            },\n            {\n                \"key\": \"targetEntityType\",\n                \"value\": \"None\"\n            },\n            {\n                \"key\": \"actorIdentityType\",\n                \"value\": \"UPN\"\n            }\n        ],\n        \"category\": \"ResourceManagement\",\n        \"correlationId\": \"923307cf-b8ac-4e26-bd47-53650a88e9fb\",\n        \"id\": \"B2C_923307cf-b8ac-4e26-bd47-53650a88e9fb_VUR48_6870123\",\n        \"initiatedBy\": {\n            \"user\": {\n                \"displayName\": \"ga-x@x.onmicrosoft.com\",\n                \"homeTenantId\": null,\n                \"homeTenantName\": null,\n                \"id\": null,\n                \"ipAddress\": \"X.X.X.X\",\n                \"userPrincipalName\": \"ga-x@x.onmicrosoft.com\"\n            }\n        },\n        \"loggedByService\": \"B2C\",\n        \"result\": \"success\",\n        \"resultReason\": null,\n        \"targetResources\": [\n            {\n                \"displayName\": null,\n                \"groupType\": null,\n                \"id\": \"NotSet\",\n                \"modifiedProperties\": [\n                ],\n                \"type\": \"Other\",\n                \"userPrincipalName\": null\n            }\n        ],\n        \"userAgent\": null\n    },\n</code></pre>"},{"location":"2025/09/02/entra-useless-insights-report/","title":"Entra Useless Insights Report","text":"<p>Yes. The name is snarky on purpose.</p> <p>With the drive to using phishing-resistant MFA something on the mind of many organizations, I\u2019ve been taking a look at the Usage &amp; Insights Report features in Entra, specifically the Authentication methods activity report.</p> <p>Enumerating the type of authentication methods registered on a user, on a per-user basis, can be time consuming, and would become untenable in extremely large organizations.</p> <p>Authentication methods activity reporting to the rescue \u2013 right? Not so much.</p> <p>In digging into the report, whether it\u2019s through the Entra admin center or through Microsoft Graph PowerShell SDK, the data reported through this is just astoundingly awful if you want to try and build some basic measurements around who is actually registered for passkeys (FIDO2); I haven\u2019t looked to see if it\u2019s as awful with other methods.</p> <p>Luckily in the tenant I\u2019m examining, there are only a few hundred user objects, so it\u2019s also feasible to enumerate each user the long way, which I\u2019ll cover below as the workaround. I\u2019ve posed a complaint to Microsoft in some channels and have yet to hear anything back, other than similar experiences from a few others.</p>"},{"location":"2025/09/02/entra-useless-insights-report/#the-problem","title":"The Problem","text":"<p>I\u2019m focused on finding users registered for passkeys in Entra, and by passkeys I mean using the Microsoft Authenticator App on either Android or iOS devices.</p> <p>The behavior I\u2019m seeing has been problematic over the last month, but I suspect the report has been broken for quite some time.</p> <p>In this instance, I go into the Usage &amp; Insights reports, Authentication methods, and filter by Method: Passkey (Microsoft Authenticator), and I see the following:</p> <p></p> <p>But based on what I know, that seems way off, so I decide to run a Graph PowerShell SDK command and get the same results:</p> <pre><code>(Get-MgReportAuthenticationMethodUserRegistrationDetail `\n -Filter \"methodsRegistered/any(x:x eq 'passKeyDeviceBoundAuthenticator')\" `\n | Select-Object -Property UserPrincipalName).count\n54\n</code></pre> <p>Note that in Graph passkeyDeviceBoundAuthenticator is what differentiates this from just passkeyDeviceBound, which would include FIDO2 security keys.</p> <p>Back to the point, this number is low, and it\u2019s been historically low. One thing that I find interesting, and while I\u2019m redacting the actual data, is when I run:</p> <pre><code>Get-MgReportAuthenticationMethodUserRegistrationDetail `\n -Filter \"methodsRegistered/any(x:x eq 'passKeyDeviceBoundAuthenticator')\"\n</code></pre> <p>and examine the LastUpdatedDateTime value, for most of the users it\u2019s showing a date that is about a week old. I know that Usage &amp; Insights reports are not real-time; trying to think back to my Microsoft days, in my head the delay I thought was roughly two hours. But there are other issues \u2013 a user who has registered for a passkey back in Feburary 2025 is missing from the report. If the report never does anything to reconcile itself, it\u2019s of zero value.</p> <p>To spot check this user I run:</p> <p><pre><code>Get-MgReportAuthenticationMethodUserRegistrationDetail `\n -Filter \"methodsRegistered/any(x:x eq 'passKeyDeviceBoundAuthenticator')\" `\n | Select-Object -Property UserPrincipalName,LastUpdatedDateTime `\n | Where-Object {$_.UserPrincipalName -eq \"user@domain.com\"}\n</code></pre> And receive nothing back.</p> <p>I went to check the Microsoft docs here, Usage and insights report \u2013 Microsoft Entra ID | Microsoft Learn, to see if there is any details around the frequency this runs or known issues, but found nothing.</p>"},{"location":"2025/09/02/entra-useless-insights-report/#the-workaround","title":"The Workaround","text":"<p>So, it\u2019s back to doing essentially what the report should do, which is enumerate all users within Entra.</p> <p>Of course, Microsoft specifically recommends that you don\u2019t do this in the docs, Microsoft Entra authentication methods API overview \u2013 Microsoft Graph v1.0 | Microsoft Learn, where they state:</p> <p>We don\u2019t recommend using the authentication methods APIs for scenarios where you need to iterate over your entire user population for auditing or security check purposes. For these types of scenarios, we recommend using the authentication method registration and usage reporting APIs (available on the beta endpoint only).</p> <p>registration and usage reporting APIs (available on the beta endpoint only).</p> <p>The code I slapped together is a mix of my brain and some vibe coding, it ended up looking like the following, with a bit of parralel processing thrown in:</p> <pre><code># Authenticator App AAGUIDS\n$targetAAGUIDs = @(\n    '90a3ccdf-635c-4729-a248-9b709135078f',\n    'de1e552d-db1d-4423-a619-566b625cdc84'\n)\n\n# Grab all users\n#$AllEmployees = Get-MgBetaUser -All -Filter \"userType eq 'Member'\" -Property Id,UserPrincipalName\n\n# Run up to 10 employees in parallel\n$PasskeysRegistered =\n    $AllEmployees |\n    ForEach-Object -Parallel {\n\n        $emp = $_\n\n        $fidos = Get-MgBetaUserAuthenticationFido2Method -UserId $emp.Id -All -ErrorAction SilentlyContinue |\n                 Where-Object { $_.AaGuid -in $using:targetAAGUIDs }\n\n        foreach ($key in $fidos) {\n            [pscustomobject]@{\n                UserPrincipalName       = $emp.UserPrincipalName\n                ObjectId     = $emp.Id\n                Passkey      = $key.Model\n                RegisteredOn = $key.CreatedDateTime\n            }\n        }\n    } -ThrottleLimit 10\n\n$PasskeysRegistered\n</code></pre> <p>And then if I run a count, and ensure I\u2019m focused on unique users, since the results could have multiple entries for some users:</p> <pre><code>($PasskeysRegistered | Select-Object -Property UserPrincipalName -Unique).count\n92\n</code></pre> <p>Further, if I go search for my missing user, sure enough they are there:</p> <pre><code>$PasskeysRegistered | Where-Object {$_.UserID -eq \"user@domain.com\"}\n\nUserID              ObjectId                             Passkey                       RegisteredOn\n------              --------                             -------                       ------------\nuser@domain.com     xxxxx                                Microsoft Authenticator - iOS 2/27/2025 10:23:40 PM\n</code></pre> <p>As a side not the problem, one could theorize something was broken around that time in Entra, and hence the user somehow fell off the report. But I can actually find another user on the report who registered within twenty minutes of the missing user \ud83e\udd14.</p>"},{"location":"2025/09/02/entra-useless-insights-report/#the-takeaway","title":"The Takeaway","text":"<p>Don\u2019t trust Usage &amp; Insights reports for passkey reporting. Hopefully this post can become irrelevant down the road.</p>"},{"location":"2025/01/13/spying-on-your-isvs-credential-choices/","title":"Spying On Your ISVs Credential Choices","text":"<p>Microsoft, and the general identity industry, has recommended that applications use certificates over secrets when it comes to credentials for things like applications. This recommendation has existed for about as long modern authentication and authorization systems have existed \u2013 over a decade now. Yet the reality is that there continues to be mystery shrouded around certificates, and sysadmins and developers still lean into using secrets.</p> <p>Secrets are problematic because they are nothing more than a password. Secrets are so much just a password that while Microsoft might refer to secrets as secrets in the UI for Entra, the underlying attribute name is passwordCredentials! While you can use systems like Azure Key Vault for secure management of who has access to the secrets, the reality is that secrets tend to be managed insecurely, both in transport and at rest. Identity Protection exists for workload identities, but it is not real time, and there are scenarios where it will not help you if the abuse is coming from inside the same trusted network.</p> <p>It\u2019s easy for organizations to determine what they are using with single-tenant applications, or if they are a developer of a multi-tenant app. A quick Microsoft Graph API call to applications/objectid of the application (app registration), and you can examine whether the application has certificates, secrets, or both assigned as credentials. You can also store credentials on the service principal, which I cover here, Entra App Registrations and Enterprise Applications: The Definitive Guide \u2013 Eric on Identity.</p> <pre><code>\"keyCredentials\": [\n    {\n        \"customKeyIdentifier\": \"2335C167C72B21C4ACA7F3AA191FA95F8A39A727\",\n        \"displayName\": \"Test certificate\",\n        \"endDateTime\": \"2024-11-06T18:47:27Z\",\n        \"key\": null,\n        \"keyId\": \"4ca658ff-a617-4161-93e0-465badaf7c3d\",\n        \"startDateTime\": \"2023-11-06T18:27:27Z\",\n        \"type\": \"AsymmetricX509Cert\",\n        \"usage\": \"Verify\"\n    }\n],\nExample certificate credentials\n\n\"passwordCredentials\": [\n    {\n        \"customKeyIdentifier\": null,\n        \"displayName\": \"test secret\",\n        \"endDateTime\": \"2025-07-07T23:25:23.333Z\",\n        \"hint\": \"zoZ\",\n        \"keyId\": \"e5ab0baa-5eb9-4180-9ad5-b1c693b7ee08\",\n        \"secretText\": null,\n        \"startDateTime\": \"2025-01-09T00:25:23.333Z\"\n    }\n],\n</code></pre> <p>Example secret credentials</p> <p>This is great, but this doesn\u2019t help you understand what your software vendor is using.</p>"},{"location":"2025/01/13/spying-on-your-isvs-credential-choices/#look-to-the-logs","title":"Look to the logs","text":"<p>Lucky for us, there are hints about the type of authentication vendors use in our Entra ID sign-in and Graph activity logs.</p>"},{"location":"2025/01/13/spying-on-your-isvs-credential-choices/#entra-id-sign-in-logs","title":"Entra ID Sign-in logs","text":"<p>In the Entra admin portal, you can browse to Identity, select show more, Monitoring &amp; health, and Sign-in logs. In the sign-in events blade that opens on the right, select Service principal sign-ins. Direct link to the sign-in logs is here, Sign-in events \u2013 Microsoft Entra admin center, but note that you\u2019ll need to still select Service principal sign-ins.</p> <p>Searching the logs is a bit different, as the portal will aggregate logs by the application. If you select the arrow on the left of the date, it will expand all the aggregated sign-in logs.</p> <p>In here, just select the date for one of the logs; make sure you don\u2019t select the service principal ID as it will actually open up the properties for the service principal instead.</p> <p>Once selected, an Activity Details: Sign-ins blade will open on the right. In here we simply need to examine the Client credential type.</p> <p>In the example below, we see that the client credential type is client secret, aka, password.</p> <p> Example client credential type of a secret (password)</p> <p>Whereas if the application is using certificates, the client credential type will show up as client assertion.</p> <p> Example client credential type of assertion (certificate)</p> <p>The unfortunate surprise is that the data available through Graph API does not match the data available in diagnostic logging.</p> <p>In the portal, the backend queries for the audit logs are coming from the Graph API endpoint https://graph.microsoft.com/beta/auditLogs/signIns. We can determine the exact queries being used with Graph X-Ray, and then make the same queries to Graph, and see the raw results:</p> <pre><code>\"value\": [\n    {\n        \"id\": \"c7db3bec-cb55-4ee7-8022-f51aa9603100\",\n        \"createdDateTime\": \"2025-01-09T11:00:51Z\",\n        \"userDisplayName\": null,\n        \"userPrincipalName\": null,\n        \"userId\": \"\",\n        \"appId\": \"86261278-59ef-4d12-8e21-\",\n        \"appDisplayName\": \"xxx\",\n        \"ipAddress\": \"xxx\",\n        \"ipAddressFromResourceProvider\": null,\n        \"clientAppUsed\": null,\n        \"userAgent\": null,\n        \"correlationId\": \"a22a7306-b6ae-4501-b2be-9fe5af3e327c\",\n        \"conditionalAccessStatus\": \"notApplied\",\n        \"originalRequestId\": \"\",\n        \"isInteractive\": false,\n        \"tokenIssuerName\": null,\n        \"tokenIssuerType\": \"UnknownFutureValue\",\n        \"clientCredentialType\": \"clientSecret\",\n        \"processingTimeInMilliseconds\": -1,\n        \"riskDetail\": \"none\",\n</code></pre> <p>The unfortunate surprise is that the data available through Entra diagnostic logging is not the same dataset.</p> <p>Querying AADServicePrincipalSignInLogs is as simple as running the following KQL query:</p> <pre><code>AADServicePrincipalSignInLogs\n</code></pre> <p>We could then further filter this by the service principal, time range, and such. But the results, when we expand them, do not contain any information about the type of authentication.</p> <p> Example log analytic result of a service principal sign-in</p> <p>The only bits of information relevant to the type of credential used are the servicePrincipalCredentialKeyId, but because the app registration is not in our tenant, we have no way of cross-referencing this. The service principal in our home tenant does not contain any references to the credentials on the app registration that we could correlate with either.</p>"},{"location":"2025/01/13/spying-on-your-isvs-credential-choices/#graph-activity-logs","title":"Graph Activity logs","text":"<p>Where our sign-in logs fail us, at least with our diagnostic logging, Graph activity logs have our back. Unfortunately, it\u2019s likely that this sort of snooping alone does not make it worth it to enable Graph activity logs; organizations need to evaluate the cost that would come along with enabling these logs and the additional overhead in Log Analytics.</p> <p>Because Graph activity logs can be a vast sea of data, the easiest way to examine a particular application is filtering by the service principal ID with a basic KQL query:</p> <pre><code>MicrosoftGraphActivityLogs | where ServicePrincipalId == \"insert id here\"\n</code></pre> <p>In the results, we can look at the ClientAuthMethod. If the method is 1, then a secret was used, such as below:</p> <p> Example graph activity log showing a secret credential used</p> <p>If ClientAuthMethod shows 2, then a certificate was used for authentication.</p> <p>If we wanted to more efficiently search for ISV applications that are using secrets, we could cross-reference a list of known Microsoft applications by the application (client) ID, and then search our Graph activity log, also filtering only for ClientAuthMethod of 1, like the following:</p> <pre><code>let MicrosoftApps = externaldata(AppId: string)\n    [@\"https://raw.githubusercontent.com/merill/microsoft-info/main/_info/MicrosoftApps.json\"]\n    with (format=\"json\");\nMicrosoftGraphActivityLogs | \nwhere ServicePrincipalId != \"\" and AppId !in (MicrosoftApps) and ClientAuthMethod == \"1\" | \ndistinct ServicePrincipalId\n</code></pre> <p>Our results should then show all service principal IDs for ISV software that are using secrets. Note my test tenant currently one has one:</p> <p></p> <p>The resulting list of IDs be used in Graph or searching in Enterprise Applications to determine what application(s) are using secrets.</p>"},{"location":"2025/01/13/spying-on-your-isvs-credential-choices/#what-to-do-with-this-data","title":"What to do with this data?","text":"<p>As a consumer of multi-tenant applications, the best (and only) way to impact change is to contact your software vendor, if you feel strongly that they should be using certificates. There is nothing from a technical standpoint, beyond stopping consumption of the application, that you can do to prevent the use of secrets.</p> <p>When contacting your vendor, remind them of Microsoft (and industry best practices), which you can find here, Security best practices for application properties \u2013 Microsoft identity platform | Microsoft Learn. But note that software is hard, switching the credential type might be more complex on the backend than you may realize, and it might take the voice of many customers to really impact change.</p>"},{"location":"2024/03/26/the-intersection-of-graph-and-entra-id-application-permissions-and-roles/","title":"The Intersection of Graph and Entra ID: Application Permissions and Roles","text":"<p>When you build software that talks to Microsoft Entra ID, you eventually run into the question of which Microsoft Graph permissions to use. That question has gotten a lot more attention after the Midnight Blizzard intrusion at Microsoft, where attackers appear to have abused service principals and Graph permissions inside Microsoft\u2019s own tenant.</p> <p>For background on that incident and what it means for Azure and Entra admins, Andy Robbins has an excellent write-up that\u2019s worth reading.</p>"},{"location":"2024/03/26/the-intersection-of-graph-and-entra-id-application-permissions-and-roles/#primer-on-the-microsoft-graph-api","title":"Primer on the Microsoft Graph API","text":"<p>Before diving into the details of application permissions and roles, it helps to level-set how Microsoft Graph works. If you already live and breathe Graph, feel free to skim this section.</p>"},{"location":"2024/03/26/the-intersection-of-graph-and-entra-id-application-permissions-and-roles/#what-is-graph-api","title":"What is Graph API","text":"<p>The Microsoft Graph API is the unified REST endpoint for most Microsoft 365 services, including Entra ID. In this post, when we say \u201cGraph\u201d or \u201cGraph API,\u201d we\u2019re talking about Microsoft Graph specifically.</p> <p></p> <p>You can think of Graph as the front door: behind it sit services such as Entra ID, Exchange Online, SharePoint, Teams, and more. Most modern integrations with Microsoft 365 are built on top of Graph.</p> <p>Microsoft\u2019s official documentation is the best place to go for a deeper overview of Graph\u2019s capabilities and supported workloads.</p>"},{"location":"2024/03/26/the-intersection-of-graph-and-entra-id-application-permissions-and-roles/#what-are-application-permissions","title":"What are Application Permissions","text":"<p>Graph exposes two major permission types:</p> <ul> <li>Delegated permissions \u2013 the app acts on behalf of a user.</li> <li>Application permissions \u2013 the app acts as itself, without a signed-in user.</li> </ul> <p>In this article we\u2019ll focus on application permissions. These are what you typically use for things like scheduled scripts, daemon services, or backend services that manage Entra ID objects on a schedule.  </p> <p>A classic example is a script that creates or updates user objects in Entra ID. If it\u2019s running as a background process, it should authenticate as an application (service principal) and rely on application permissions.</p> <p>Many third-party SaaS products do the same: they authenticate as an app, not a person, and use application permissions to perform tasks like reading all calendars in Exchange Online or managing directory data.</p> <p>Delegated permissions, in contrast, are about acting in the context of a user \u2013 e.g., an app that reads my OneDrive or my calendar after I sign in and consent.</p>"},{"location":"2024/03/26/the-intersection-of-graph-and-entra-id-application-permissions-and-roles/#how-graph-interacts-with-entra-id","title":"How Graph Interacts with Entra ID","text":"<p>When you call Graph, the path in the URL determines which service you\u2019re actually talking to. You don\u2019t call Entra ID directly; you call Graph, and Graph routes the request.</p> <p></p> <p>A Graph request has a couple of important pieces:</p> <ul> <li>The version/endpoint (<code>v1.0</code> or <code>beta</code>), and  </li> <li>The resource path (users, groups, directoryObjects, etc.).</li> </ul> <p>In most everyday use, you don\u2019t have to worry about which backend service is involved; Graph figures that out based on the resource path. It does start to matter when you run into throttling. Different resource families are backed by different services, each with its own limits. If you see a 429 response from Graph, you\u2019re hitting those throttling limits.</p> <p>Microsoft publishes service-specific throttling guidance that\u2019s worth reviewing if you\u2019re automating heavily against Graph.</p>"},{"location":"2024/03/26/the-intersection-of-graph-and-entra-id-application-permissions-and-roles/#talking-to-graph","title":"Talking to Graph","text":"<p>Graph is a REST API, so you use HTTP methods to interact with it. If you come from a traditional sysadmin background, the mapping between CRUD concepts and HTTP verbs looks like this:</p> CRUD operation HTTP method Create POST Read GET Update PATCH / PUT Delete DELETE <p>In practice, most update operations for Entra ID resources use PATCH rather than PUT. There are only a handful of Entra operations that use PUT.</p> <p>Tools like Graph Explorer make it easier to get hands-on with the API and see the raw requests and responses.</p>"},{"location":"2024/03/26/the-intersection-of-graph-and-entra-id-application-permissions-and-roles/#exploring-application-permissions","title":"Exploring application permissions","text":"<p>If you\u2019ve spent time with Active Directory access control lists and access control entries, the idea of permissions in Entra ID is not completely foreign\u2014but the model is different enough that it\u2019s worth walking through.</p>"},{"location":"2024/03/26/the-intersection-of-graph-and-entra-id-application-permissions-and-roles/#where-permissions-exist","title":"Where permissions exist","text":"<p>In on-prem Active Directory, you attach permissions directly to the target objects. For example, if Sarah needs to reset passwords, you grant the Reset password right on user objects (often via an OU so it inherits to multiple users).</p> <p></p> <p>To allow Todd to create new groups, you\u2019d grant him a \u201ccreate group objects\u201d right on an OU. The OU is the container, and the permissions cascade to the objects underneath it.</p> <p></p> <p>You can think of service accounts the same way: whether it\u2019s a gMSA or a user account acting as a service account, you still attach permissions to the objects being protected.</p> <p></p> <p>In Entra ID, Graph API permissions work differently. Permissions are applied to the requesting service principal, not to the target objects. App registrations describe what an application wants, but the service principal is what actually holds the delegated and application permission grants.</p> <p>If you\u2019re fuzzy on the difference between app registrations and enterprise applications, it\u2019s worth reviewing that first \u2013 app registrations are the app definitions, whereas enterprise applications (service principals) are the instances in a tenant.</p> <p>Application permissions show up as appRoleAssignment resources linked to the service principal.</p> <p>Imagine an example where an application needs to create a group.</p> <p></p> <p>Here, a backend service (\u201cCloud Application\u201d) authenticates as a service principal. That service principal has been granted the Graph application permission Group.Create, which allows it to create groups in Entra ID.</p> <p>From an operational security perspective, we should treat these service principals as modern service accounts. Anywhere we can replace a traditional user-based service account with a service principal in Entra ID, we should. That applies just as much to one-off admin scripts as it does to ISV software.</p>"},{"location":"2024/03/26/the-intersection-of-graph-and-entra-id-application-permissions-and-roles/#consenting-to-graph-permissions","title":"Consenting to Graph permissions","text":"<p>In the Entra admin center, you specify required permissions on the app registration. That\u2019s only half the story, though \u2013 the permissions must also be granted in the tenant.</p> <p>That\u2019s what admin consent does: it approves the requested Graph permissions for your organization.</p> <p>There are two small but important nuances:</p> <ul> <li>Both the app registration blade and the enterprise application blade have a Grant admin consent button. They perform the same operation; the button on the app registration blade is just there for convenience.</li> <li>Only Global Administrator can grant consent for Microsoft Graph application permissions. While documentation often suggests that Application Administrator or Cloud Application Administrator can grant consent, that does not apply to Graph app perms.</li> </ul>"},{"location":"2024/03/26/the-intersection-of-graph-and-entra-id-application-permissions-and-roles/#putting-permissions-into-action","title":"Putting permissions into action","text":"<p>Let\u2019s walk through a simple scenario where an application uses Graph application permissions to create groups in Entra ID.</p> <p>We\u2019ve created a new application, Cloud Application, and granted it the Group.Create application permission. After consenting to the permission, we can see it listed on the service principal.</p> <p></p> <p>For this walkthrough we\u2019ll use the Microsoft Graph PowerShell SDK to talk to Graph.</p> <p>We connect using application credentials (for example, a client secret or certificate) and specify our tenant ID. We can then confirm our context with <code>Get-MgContext</code>.</p> <p></p> <p>The output shows that we\u2019re connected as the Cloud Application app, and the <code>Scopes</code> field includes the application permission we assigned.</p> <p>Next, we create a group using the SDK.</p> <p></p> <p>If we look at the Entra audit logs, we can see the group creation event attributed to the Cloud Application service principal.</p> <p></p> <p></p> <p>However, because the app only has Group.Create, it can\u2019t update or delete the group. Attempts to delete the group fail with an authorization error.</p> <p></p>"},{"location":"2024/03/26/the-intersection-of-graph-and-entra-id-application-permissions-and-roles/#when-application-permissions-can-become-tricky","title":"When application permissions can become tricky","text":"<p>Suppose we decide the app should be able to delete groups as well. Our initial intuition might be that there\u2019s a Group.Delete permission we can add, similar to the precision we\u2019re used to in AD.</p> <p>When we look at Graph\u2019s available application permissions for groups, reality looks different.</p> <p></p> <p>In addition to Group.Create, the only other group-related application permissions are:</p> <ul> <li>Group.Read.All</li> <li>Group.ReadWrite.All</li> </ul> <p>To let the app delete groups, we have to assign Group.ReadWrite.All, which effectively gives it full read/write access across all groups in the tenant.</p> <p></p> <p>After we add the permission, disconnect, and reconnect, we can see both scopes in <code>Get-MgContext</code>.</p> <p></p> <p>Now a deletion that previously failed succeeds without error.</p> <p></p> <p>We can also add users to the group using the same context.</p> <p></p> <p>The catch is obvious: we wanted the ability to manage some groups, but Group.ReadWrite.All applies to all groups in the directory. That\u2019s where Entra roles, combined with admin units, can help.</p>"},{"location":"2024/03/26/the-intersection-of-graph-and-entra-id-application-permissions-and-roles/#roles-can-fill-the-application-permission-granularity-gap-somewhat","title":"Roles can fill the application permission granularity gap \u2013 somewhat","text":"<p>Our desired scenario is to let the application manage only a subset of groups, not every group in the tenant.</p> <p></p> <p>In traditional Active Directory, we\u2019d solve this by organizing groups into a dedicated OU and applying granular permissions on that OU (or on specific group objects).</p> <p>In Entra ID, we can approximate this pattern using Administrative Units (AUs) and directory roles.</p> <p>First, we strip away the Graph application permissions we\u2019ve granted.</p> <p></p> <p>Then we assign the Groups Administrator role to the Cloud Application service principal, scoped to a specific administrative unit.</p> <p></p> <p>When we connect to Graph and run <code>Get-MgContext</code>, we see that there are no Graph scopes present. The app doesn\u2019t have application permissions anymore, but it does have the directory role assignment in Entra.</p> <p></p> <p>If we try to modify a group that sits outside the scoped administrative unit, the operation fails\u2014exactly what we want.</p> <p>(screenshot of failed attempt to modify an out-of-scope group \u2013 img22.png)</p> <p>When we target a group that is in the administrative unit, the operation succeeds.</p> <p></p> <p>So now, our combination of permissions and roles gives us the ability to manage just the groups we\u2019ve scoped to the AU.</p> <p></p> <p>However, this model is somewhat restrictive. In the example above, we already know the object ID of the group we want to modify. If we don\u2019t, we might want to list the groups in the administrative unit.</p> <p>With only the current role assignment, we can\u2019t enumerate them via Graph.</p> <p></p>"},{"location":"2024/03/26/the-intersection-of-graph-and-entra-id-application-permissions-and-roles/#getting-into-the-thick-of-permissions-and-roles","title":"Getting into the thick of permissions and roles","text":"<p>At this point the pattern becomes clear: to perform operations as an application, we need some combination of Graph application permissions and directory roles that together authorize the actions we care about.</p> <p>To list objects in the administrative unit, we add AdministrativeUnit.Read.All to the application.</p> <p></p> <p>With that permission in place, we can enumerate members of the administrative unit via Graph.</p> <p></p> <p>If we also want to enumerate users in the tenant to decide who to place in the group, that\u2019s another permission. If we want to check whether a group already exists before we create it, that\u2019s yet another permission.</p> <p></p> <p>For a relatively small set of operations\u2014creating and managing certain groups, reading users, and scoping everything to an AU\u2014we end up with a permission and role model that looks something like:</p> <ul> <li>Graph application permissions:</li> <li>AdministrativeUnit.Read.All  </li> <li>Group.Read.All / Group.ReadWrite.All (depending on needs)  </li> <li>User.Read.All</li> <li>Directory role:</li> <li>Groups Administrator, scoped to the administrative unit</li> </ul> <p>Real-world software that manages large slices of Entra ID or Microsoft 365 tends to accumulate a lot of these permissions quickly. The more capabilities the tool has, the broader the Graph permissions usually need to be.</p>"},{"location":"2024/03/26/the-intersection-of-graph-and-entra-id-application-permissions-and-roles/#take-the-time-to-understand-and-test-permissions-and-roles","title":"Take the time to understand, and test, permissions and roles","text":"<p>Permissions and roles for applications in Entra ID can look intimidating at first, but understanding how they interact is critical if you want to secure your tenant.</p> <p>A few practical takeaways:</p> <ul> <li>Invest the time to understand how Graph application permissions and directory roles overlap and differ.</li> <li>Test your apps in a lab tenant to verify the minimum set of permissions they actually need.</li> <li>Treat service principals as first-class security identities, just like user accounts or gMSAs.</li> <li>Regularly review which apps have powerful permissions such as <code>*.Read.All</code> and <code>*.ReadWrite.All</code>.</li> </ul> <p>The goal is to ensure your apps and scripts only have the access they truly need. Otherwise, they become extremely attractive targets for lateral movement and privilege escalation.</p>"},{"location":"2024/03/26/the-intersection-of-graph-and-entra-id-application-permissions-and-roles/#about-this-posts-featured-image","title":"About This Post\u2019s Featured Image","text":"<p>The featured image for this post is a photograph by Danielle Rice, used under the Unsplash license.</p>"},{"location":"archive/2025/","title":"2025","text":""},{"location":"archive/2024/","title":"2024","text":""},{"location":"archive/2023/","title":"2023","text":""}]}