{"config":{"lang":["en"],"separator":"[\\s\\-]+","pipeline":["stopWordFilter"]},"docs":[{"location":"2025/02/20/an-interesting-m365-billing-scam/","title":"An Interesting M365 Billing Scam","text":""},{"location":"2025/02/20/an-interesting-m365-billing-scam/#update","title":"Update","text":"<p>I called the 888 number this morning and it does indeed go to a scam call center. I played along with the person on the other end, who ultimately wanted my first and last name, email address, the order number, and most importantly, my credit card number, so they \u201ccould reverse the charge\u201d \ud83e\udd23</p>"},{"location":"2025/02/20/an-interesting-m365-billing-scam/#the-scam","title":"The Scam","text":"<p>This is a case where I\u2019d actually love to see how this plays out \u2013 when you see the way that scammers try to string things together. I\u2019ve been receiving a rash of unpaid toll bill texts, which give themselves away pretty easily based on the source number. But I\u2019m not here to talk about that scam.</p> <p>Instead, I\u2019m here to dig into this email I received last week:</p> <p></p> <p>Last time I checked, I\u2019m not Molly Wagner</p> <p>It looked authentic, and when I checked the headers, it is indeed from Microsoft. I do subscribe to various Microsoft services and receiving emails like this are not abnormal, but I was certainly confused by the service, as well as who it was to.</p> <p>I scroll down a bit more into the rest of the email:</p> <p></p> <p>Notice anything unusual? At first, I didn\u2019t. To give myself props, even though it all seemed legitimate, I didn\u2019t click on the link.</p> <p>But when I saw the domain JacksonLyons.onmicrosoft.com I decided to go look it up over at https://aadinternals.com/osint/. The results:</p> Property Value Default domain JacksonLyons.onmicrosoft.com Tenant name null Tenant brand Microsoft We appreciate your purchase and have finished your recent order for 592.99 USD. Please contact us at (888) 929-1904 for help or cancelation. Tenant id 6cc54dbc-77fb-44e7-9c6f-ca766a8e26b1 Tenant region NA Seamless single sign-on (SSSO) disabled Uses Azure AD Connect cloud sync N/A Certificate-based authentication (CBA) N/A <p>The results make me wonder if the tenant is turned off on the Microsoft side, as there are no verified domains, but there is a Tenant ID, and the interesting Tenant brand.</p> <p>Of course, it appears that smithkrause.onmicrosoft.com is the vehicle behind this, and in particular mollywagner@smithkrause.onmicrsoft.com.</p> <p>Back to another lookup courtesy of @drazuread.bksy.social:</p> Property Value Default domain SmithKrause.onmicrosoft.com Tenant name SmithKrause.onmicrosoft.com Tenant brand SmithKrause Tenant id eecfe604-36e5-4e7c-86ee-2313e05112aa Tenant region NA Seamless single sign-on (SSSO) disabled Uses Azure AD Connect cloud sync N/A Certificate-based authentication (CBA) N/A Verified domains 2 Domain Type STS addiamaryellen.gigasphere.site Managed SmithKrause.onmicrosoft.com Managed <p>Pulling a whois of gigasphere.site, the domain is relatively fresh:</p> <pre><code>Domain Name: GIGASPHERE.SITE\nRegistry Domain ID: D524536986-CNIC\nRegistrar WHOIS Server: whois.namecheap.com\nRegistrar URL: https://namecheap.com\nUpdated Date: 2025-02-05T10:49:53.0Z\nCreation Date: 2025-02-05T10:49:48.0Z\nRegistry Expiry Date: 2026-02-05T23:59:59.0Z\nRegistrar: Namecheap\nRegistrar IANA ID: 1068\n</code></pre> <p>When digging into DNS, both gigasphere.site and addiamaryellen.gigasphere.site only have MX and SPF records for EXO (gigasphere.site DNS is hosted by Cloudflare).</p> <p>Of course, the email originated from a smithkrause.onmicrosoft.com domain, which I can\u2019t tell the age of, or at least not through AAD Internals OSINIT. Another interesting thing to note is that the people behind the scam are populating a distribution list with the target email addresses; when looking at the headers the To: is indeed mollywagner@smithkrause.onmicrosoft.com.</p> <p>In due diligence I submitted the email review in M365 Defender, which came back with a no threats found</p> <p></p> <p>Apparently, the body of the email containing \"Microsoft We appreciate your purchase and have finished your recent order for 592.99 USD. Please contact us at (888) 929-1904 for help or cancelation.\" isn\u2019t sufficient enough to be considered suspicious \ud83d\ude44.</p> <p>For fun, I did call the number, but right now the scammers number just forwards to a voicemail box; if I\u2019m able to get ahold of them and resolve my billing issues I\u2019ll follow up \ud83d\ude09.</p> <p>And the link? The link is benign, it just goes to the M365 admin billing portal, because the email as far as I can tell is legit from Microsoft.</p> <p>The first few hops on the headers appear to be coming from some MS backend service and it hits the DL on hop 5, based on looking at the headers on https://mxtoolbox.com/EmailHeaders.aspx:</p> Hop Delay From By With Time (UTC) Blacklist 1 * outlook.office365.com 2603:10b6:303:18d::16 MW4PR20MB4527.namprd20.prod.outlook.com HTTP 2/13/2025 2:40:06 PM \u2705 2 2 seconds NAM10-DM6-obe.outbound.protection.outlook.com 2a01:111:f403:2413::720 SJ1PEPF00002313.mail.protection.outlook.com 2603:10b6:a0f:fc02::1a7 Microsoft SMTP Server (version=TLS1_3, cipher=TLS_AES_256_GCM_SHA384) 2/13/2025 2:40:08 PM \u2705 3 0 seconds SJ1PEPF00002313.namprd03.prod.outlook.com 2603:10b6:a03:54:cafe::b3 BYAPR02CA0055.outlook.office365.com 2603:10b6:a03:54::32 Microsoft SMTP Server (version=TLS1_3, cipher=TLS_AES_256_GCM_SHA384) 2/13/2025 2:40:08 PM \u2705 4 0 seconds BYAPR02CA0055.namprd02.prod.outlook.com 2603:10b6:a03:54::32 SJ2PR17MB6565.namprd17.prod.outlook.com 2603:10b6:a03:4f6::19 Microsoft SMTP Server (version=TLS1_2, cipher=TLS_ECDHE_RSA_WITH_AES_256_GCM_SHA384) 2/13/2025 2:40:08 PM \u2705 5 47 seconds BY5PR17MB3063.namprd17.prod.outlook.com fe80::bf8c:c1de:31b1:4af5 BY5PR17MB3063.namprd17.prod.outlook.com fe80::bf8c:c1de:31b1:4af5 mapi 2/13/2025 2:40:55 PM \u274c <p>Additionally, I would think if the email was fake, they wouldn\u2019t include a legit link to the M365 Admin billing site.</p> <p>Here is what I believe is going on:</p> <ol> <li>Scammer sets up junk tenant with the scam text tenant brand info</li> <li>Distribution list is created with target email addresses</li> <li>DL is used as the billing contact email</li> <li>Scammer signs up for trial and/or service (not sure of this part in that when I looked up Dynamics 365 Sales Enterprise Edition, it\u2019s $120 USD /month)</li> <li>Email is blasted to all the targets via the DL</li> </ol> <p>Anyway, I thought it was worth a share as this seems like a new twist on using Microsoft tools to try and scam people.</p> <p>In the meantime, I\u2019ll be trying to poke at Microsoft people to take down the smithkrause domain.</p>"},{"location":"2025/09/02/entra-useless-insights-report/","title":"Entra Useless Insights Report","text":"<p>Yes. The name is snarky on purpose.</p> <p>With the drive to using phishing-resistant MFA something on the mind of many organizations, I\u2019ve been taking a look at the Usage &amp; Insights Report features in Entra, specifically the Authentication methods activity report.</p> <p>Enumerating the type of authentication methods registered on a user, on a per-user basis, can be time consuming, and would become untenable in extremely large organizations.</p> <p>Authentication methods activity reporting to the rescue \u2013 right? Not so much.</p> <p>In digging into the report, whether it\u2019s through the Entra admin center or through Microsoft Graph PowerShell SDK, the data reported through this is just astoundingly awful if you want to try and build some basic measurements around who is actually registered for passkeys (FIDO2); I haven\u2019t looked to see if it\u2019s as awful with other methods.</p> <p>Luckily in the tenant I\u2019m examining, there are only a few hundred user objects, so it\u2019s also feasible to enumerate each user the long way, which I\u2019ll cover below as the workaround. I\u2019ve posed a complaint to Microsoft in some channels and have yet to hear anything back, other than similar experiences from a few others.</p>"},{"location":"2025/09/02/entra-useless-insights-report/#the-problem","title":"The Problem","text":"<p>I\u2019m focused on finding users registered for passkeys in Entra, and by passkeys I mean using the Microsoft Authenticator App on either Android or iOS devices.</p> <p>The behavior I\u2019m seeing has been problematic over the last month, but I suspect the report has been broken for quite some time.</p> <p>In this instance, I go into the Usage &amp; Insights reports, Authentication methods, and filter by Method: Passkey (Microsoft Authenticator), and I see the following:</p> <p></p> <p>But based on what I know, that seems way off, so I decide to run a Graph PowerShell SDK command and get the same results:</p> <pre><code>(Get-MgReportAuthenticationMethodUserRegistrationDetail `\n -Filter \"methodsRegistered/any(x:x eq 'passKeyDeviceBoundAuthenticator')\" `\n | Select-Object -Property UserPrincipalName).count\n54\n</code></pre> <p>Note that in Graph passkeyDeviceBoundAuthenticator is what differentiates this from just passkeyDeviceBound, which would include FIDO2 security keys.</p> <p>Back to the point, this number is low, and it\u2019s been historically low. One thing that I find interesting, and while I\u2019m redacting the actual data, is when I run:</p> <pre><code>Get-MgReportAuthenticationMethodUserRegistrationDetail `\n -Filter \"methodsRegistered/any(x:x eq 'passKeyDeviceBoundAuthenticator')\"\n</code></pre> <p>and examine the LastUpdatedDateTime value, for most of the users it\u2019s showing a date that is about a week old. I know that Usage &amp; Insights reports are not real-time; trying to think back to my Microsoft days, in my head the delay I thought was roughly two hours. But there are other issues \u2013 a user who has registered for a passkey back in Feburary 2025 is missing from the report. If the report never does anything to reconcile itself, it\u2019s of zero value.</p> <p>To spot check this user I run:</p> <p><pre><code>Get-MgReportAuthenticationMethodUserRegistrationDetail `\n -Filter \"methodsRegistered/any(x:x eq 'passKeyDeviceBoundAuthenticator')\" `\n | Select-Object -Property UserPrincipalName,LastUpdatedDateTime `\n | Where-Object {$_.UserPrincipalName -eq \"user@domain.com\"}\n</code></pre> And receive nothing back.</p> <p>I went to check the Microsoft docs here, Usage and insights report \u2013 Microsoft Entra ID | Microsoft Learn, to see if there is any details around the frequency this runs or known issues, but found nothing.</p>"},{"location":"2025/09/02/entra-useless-insights-report/#the-workaround","title":"The Workaround","text":"<p>So, it\u2019s back to doing essentially what the report should do, which is enumerate all users within Entra.</p> <p>Of course, Microsoft specifically recommends that you don\u2019t do this in the docs, Microsoft Entra authentication methods API overview \u2013 Microsoft Graph v1.0 | Microsoft Learn, where they state:</p> <p>We don\u2019t recommend using the authentication methods APIs for scenarios where you need to iterate over your entire user population for auditing or security check purposes. For these types of scenarios, we recommend using the authentication method registration and usage reporting APIs (available on the beta endpoint only).</p> <p>registration and usage reporting APIs (available on the beta endpoint only).</p> <p>The code I slapped together is a mix of my brain and some vibe coding, it ended up looking like the following, with a bit of parralel processing thrown in:</p> <pre><code># Authenticator App AAGUIDS\n$targetAAGUIDs = @(\n    '90a3ccdf-635c-4729-a248-9b709135078f',\n    'de1e552d-db1d-4423-a619-566b625cdc84'\n)\n\n# Grab all users\n#$AllEmployees = Get-MgBetaUser -All -Filter \"userType eq 'Member'\" -Property Id,UserPrincipalName\n\n# Run up to 10 employees in parallel\n$PasskeysRegistered =\n    $AllEmployees |\n    ForEach-Object -Parallel {\n\n        $emp = $_\n\n        $fidos = Get-MgBetaUserAuthenticationFido2Method -UserId $emp.Id -All -ErrorAction SilentlyContinue |\n                 Where-Object { $_.AaGuid -in $using:targetAAGUIDs }\n\n        foreach ($key in $fidos) {\n            [pscustomobject]@{\n                UserPrincipalName       = $emp.UserPrincipalName\n                ObjectId     = $emp.Id\n                Passkey      = $key.Model\n                RegisteredOn = $key.CreatedDateTime\n            }\n        }\n    } -ThrottleLimit 10\n\n$PasskeysRegistered\n</code></pre> <p>And then if I run a count, and ensure I\u2019m focused on unique users, since the results could have multiple entries for some users:</p> <pre><code>($PasskeysRegistered | Select-Object -Property UserPrincipalName -Unique).count\n92\n</code></pre> <p>Further, if I go search for my missing user, sure enough they are there:</p> <pre><code>$PasskeysRegistered | Where-Object {$_.UserID -eq \"user@domain.com\"}\n\nUserID              ObjectId                             Passkey                       RegisteredOn\n------              --------                             -------                       ------------\nuser@domain.com     xxxxx                                Microsoft Authenticator - iOS 2/27/2025 10:23:40 PM\n</code></pre> <p>As a side not the problem, one could theorize something was broken around that time in Entra, and hence the user somehow fell off the report. But I can actually find another user on the report who registered within twenty minutes of the missing user \ud83e\udd14.</p>"},{"location":"2025/09/02/entra-useless-insights-report/#the-takeaway","title":"The Takeaway","text":"<p>Don\u2019t trust Usage &amp; Insights reports for passkey reporting. Hopefully this post can become irrelevant down the road.</p>"},{"location":"2025/01/13/spying-on-your-isvs-credential-choices/","title":"Spying On Your ISVs Credential Choices","text":"<p>Microsoft, and the general identity industry, has recommended that applications use certificates over secrets when it comes to credentials for things like applications. This recommendation has existed for about as long modern authentication and authorization systems have existed \u2013 over a decade now. Yet the reality is that there continues to be mystery shrouded around certificates, and sysadmins and developers still lean into using secrets.</p> <p>Secrets are problematic because they are nothing more than a password. Secrets are so much just a password that while Microsoft might refer to secrets as secrets in the UI for Entra, the underlying attribute name is passwordCredentials! While you can use systems like Azure Key Vault for secure management of who has access to the secrets, the reality is that secrets tend to be managed insecurely, both in transport and at rest. Identity Protection exists for workload identities, but it is not real time, and there are scenarios where it will not help you if the abuse is coming from inside the same trusted network.</p> <p>It\u2019s easy for organizations to determine what they are using with single-tenant applications, or if they are a developer of a multi-tenant app. A quick Microsoft Graph API call to applications/objectid of the application (app registration), and you can examine whether the application has certificates, secrets, or both assigned as credentials. You can also store credentials on the service principal, which I cover here, Entra App Registrations and Enterprise Applications: The Definitive Guide \u2013 Eric on Identity.</p> <pre><code>\"keyCredentials\": [\n    {\n        \"customKeyIdentifier\": \"2335C167C72B21C4ACA7F3AA191FA95F8A39A727\",\n        \"displayName\": \"Test certificate\",\n        \"endDateTime\": \"2024-11-06T18:47:27Z\",\n        \"key\": null,\n        \"keyId\": \"4ca658ff-a617-4161-93e0-465badaf7c3d\",\n        \"startDateTime\": \"2023-11-06T18:27:27Z\",\n        \"type\": \"AsymmetricX509Cert\",\n        \"usage\": \"Verify\"\n    }\n],\nExample certificate credentials\n\n\"passwordCredentials\": [\n    {\n        \"customKeyIdentifier\": null,\n        \"displayName\": \"test secret\",\n        \"endDateTime\": \"2025-07-07T23:25:23.333Z\",\n        \"hint\": \"zoZ\",\n        \"keyId\": \"e5ab0baa-5eb9-4180-9ad5-b1c693b7ee08\",\n        \"secretText\": null,\n        \"startDateTime\": \"2025-01-09T00:25:23.333Z\"\n    }\n],\n</code></pre> <p>Example secret credentials</p> <p>This is great, but this doesn\u2019t help you understand what your software vendor is using.</p>"},{"location":"2025/01/13/spying-on-your-isvs-credential-choices/#look-to-the-logs","title":"Look to the logs","text":"<p>Lucky for us, there are hints about the type of authentication vendors use in our Entra ID sign-in and Graph activity logs.</p>"},{"location":"2025/01/13/spying-on-your-isvs-credential-choices/#entra-id-sign-in-logs","title":"Entra ID Sign-in logs","text":"<p>In the Entra admin portal, you can browse to Identity, select show more, Monitoring &amp; health, and Sign-in logs. In the sign-in events blade that opens on the right, select Service principal sign-ins. Direct link to the sign-in logs is here, Sign-in events \u2013 Microsoft Entra admin center, but note that you\u2019ll need to still select Service principal sign-ins.</p> <p>Searching the logs is a bit different, as the portal will aggregate logs by the application. If you select the arrow on the left of the date, it will expand all the aggregated sign-in logs.</p> <p>In here, just select the date for one of the logs; make sure you don\u2019t select the service principal ID as it will actually open up the properties for the service principal instead.</p> <p>Once selected, an Activity Details: Sign-ins blade will open on the right. In here we simply need to examine the Client credential type.</p> <p>In the example below, we see that the client credential type is client secret, aka, password.</p> <p> Example client credential type of a secret (password)</p> <p>Whereas if the application is using certificates, the client credential type will show up as client assertion.</p> <p> Example client credential type of assertion (certificate)</p> <p>The unfortunate surprise is that the data available through Graph API does not match the data available in diagnostic logging.</p> <p>In the portal, the backend queries for the audit logs are coming from the Graph API endpoint https://graph.microsoft.com/beta/auditLogs/signIns. We can determine the exact queries being used with Graph X-Ray, and then make the same queries to Graph, and see the raw results:</p> <pre><code>\"value\": [\n    {\n        \"id\": \"c7db3bec-cb55-4ee7-8022-f51aa9603100\",\n        \"createdDateTime\": \"2025-01-09T11:00:51Z\",\n        \"userDisplayName\": null,\n        \"userPrincipalName\": null,\n        \"userId\": \"\",\n        \"appId\": \"86261278-59ef-4d12-8e21-\",\n        \"appDisplayName\": \"xxx\",\n        \"ipAddress\": \"xxx\",\n        \"ipAddressFromResourceProvider\": null,\n        \"clientAppUsed\": null,\n        \"userAgent\": null,\n        \"correlationId\": \"a22a7306-b6ae-4501-b2be-9fe5af3e327c\",\n        \"conditionalAccessStatus\": \"notApplied\",\n        \"originalRequestId\": \"\",\n        \"isInteractive\": false,\n        \"tokenIssuerName\": null,\n        \"tokenIssuerType\": \"UnknownFutureValue\",\n        \"clientCredentialType\": \"clientSecret\",\n        \"processingTimeInMilliseconds\": -1,\n        \"riskDetail\": \"none\",\n</code></pre> <p>The unfortunate surprise is that the data available through Entra diagnostic logging is not the same dataset.</p> <p>Querying AADServicePrincipalSignInLogs is as simple as running the following KQL query:</p> <pre><code>AADServicePrincipalSignInLogs\n</code></pre> <p>We could then further filter this by the service principal, time range, and such. But the results, when we expand them, do not contain any information about the type of authentication.</p> <p> Example log analytic result of a service principal sign-in</p> <p>The only bits of information relevant to the type of credential used are the servicePrincipalCredentialKeyId, but because the app registration is not in our tenant, we have no way of cross-referencing this. The service principal in our home tenant does not contain any references to the credentials on the app registration that we could correlate with either.</p>"},{"location":"2025/01/13/spying-on-your-isvs-credential-choices/#graph-activity-logs","title":"Graph Activity logs","text":"<p>Where our sign-in logs fail us, at least with our diagnostic logging, Graph activity logs have our back. Unfortunately, it\u2019s likely that this sort of snooping alone does not make it worth it to enable Graph activity logs; organizations need to evaluate the cost that would come along with enabling these logs and the additional overhead in Log Analytics.</p> <p>Because Graph activity logs can be a vast sea of data, the easiest way to examine a particular application is filtering by the service principal ID with a basic KQL query:</p> <pre><code>MicrosoftGraphActivityLogs | where ServicePrincipalId == \"insert id here\"\n</code></pre> <p>In the results, we can look at the ClientAuthMethod. If the method is 1, then a secret was used, such as below:</p> <p> Example graph activity log showing a secret credential used</p> <p>If ClientAuthMethod shows 2, then a certificate was used for authentication.</p> <p>If we wanted to more efficiently search for ISV applications that are using secrets, we could cross-reference a list of known Microsoft applications by the application (client) ID, and then search our Graph activity log, also filtering only for ClientAuthMethod of 1, like the following:</p> <pre><code>let MicrosoftApps = externaldata(AppId: string)\n    [@\"https://raw.githubusercontent.com/merill/microsoft-info/main/_info/MicrosoftApps.json\"]\n    with (format=\"json\");\nMicrosoftGraphActivityLogs | \nwhere ServicePrincipalId != \"\" and AppId !in (MicrosoftApps) and ClientAuthMethod == \"1\" | \ndistinct ServicePrincipalId\n</code></pre> <p>Our results should then show all service principal IDs for ISV software that are using secrets. Note my test tenant currently one has one:</p> <p></p> <p>The resulting list of IDs be used in Graph or searching in Enterprise Applications to determine what application(s) are using secrets.</p>"},{"location":"2025/01/13/spying-on-your-isvs-credential-choices/#what-to-do-with-this-data","title":"What to do with this data?","text":"<p>As a consumer of multi-tenant applications, the best (and only) way to impact change is to contact your software vendor, if you feel strongly that they should be using certificates. There is nothing from a technical standpoint, beyond stopping consumption of the application, that you can do to prevent the use of secrets.</p> <p>When contacting your vendor, remind them of Microsoft (and industry best practices), which you can find here, Security best practices for application properties \u2013 Microsoft identity platform | Microsoft Learn. But note that software is hard, switching the credential type might be more complex on the backend than you may realize, and it might take the voice of many customers to really impact change.</p>"},{"location":"archive/2025/","title":"2025","text":""}]}